{"nr": 25027, "rule": "If someone is round and they like the bear then they are red."}
{"nr": 12376, "rule": "If something is blue then it needs the dog."}
{"nr": 26119, "rule": "If something chases the cat then it is green."}
{"nr": 12394, "rule": "If someone sees the bear then they chase the bear."}
{"nr": 6362, "rule": "If something likes the squirrel then the squirrel needs the dog."}
{"nr": 5098, "rule": "If something needs the dog then it is kind."}
{"nr": 27331, "rule": "If something is quiet then it is red."}
{"nr": 10881, "rule": "If something visits the rabbit and it needs the mouse then it visits the mouse."}
{"nr": 11029, "rule": "If someone needs the rabbit then the rabbit visits the bear."}
{"nr": 2414, "rule": "If someone is kind then they are round."}
{"nr": 24702, "rule": "If someone is blue then they need the cat."}
{"nr": 10253, "rule": "If someone sees the cat and they are not red then they eat the bear."}
{"nr": 10576, "rule": "If someone is big then they chase the mouse."}
{"nr": 2496, "rule": "If Harry is quiet and Harry is white then Harry is cold."}
{"nr": 4698, "rule": "If something is red and young then it is white."}
{"nr": 18973, "rule": "If someone is young and they do not visit the rabbit then the rabbit sees the squirrel."}
{"nr": 15121, "rule": "If the bald eagle is not green and the bald eagle is not kind then the bald eagle is nice."}
{"nr": 21905, "rule": "If something is nice then it visits the bald eagle."}
{"nr": 4713, "rule": "If something visits the dog then it visits the bald eagle."}
{"nr": 6370, "rule": "If someone is big then they see the tiger."}
{"nr": 264, "rule": "If someone is nice and not furry then they are big."}
{"nr": 25567, "rule": "If someone sees the squirrel and they are nice then the squirrel eats the mouse."}
{"nr": 7233, "rule": "If the bald eagle is not round and the bald eagle does not eat the mouse then the bald eagle is kind."}
{"nr": 18688, "rule": "If something eats the cat then it is blue."}
{"nr": 22055, "rule": "If someone eats the mouse and the mouse eats the bear then they like the cat."}
{"nr": 22146, "rule": "If something is quiet and kind then it is white."}
{"nr": 9027, "rule": "If something is green and not red then it is smart."}
{"nr": 13115, "rule": "If the rabbit does not need the squirrel then the squirrel sees the bald eagle."}
{"nr": 14669, "rule": "If someone needs the dog then they are big."}
{"nr": 13025, "rule": "If something is blue then it is green."}
{"nr": 2819, "rule": "If the mouse needs the dog then the dog is blue."}
{"nr": 4260, "rule": "If the cow needs the mouse then the mouse visits the rabbit."}
{"nr": 26706, "rule": "If the dog is cold and the dog visits the bear then the dog needs the lion."}
{"nr": 10552, "rule": "If someone is nice then they like the tiger."}
{"nr": 24883, "rule": "If Gary is blue and Gary is white then Gary is red."}
{"nr": 1759, "rule": "If Dave is smart then Dave is blue."}
{"nr": 7974, "rule": "If the lion needs the bald eagle then the lion visits the bald eagle."}
{"nr": 19164, "rule": "If something is red then it chases the cow."}
{"nr": 8002, "rule": "If the mouse needs the bear and the mouse sees the bear then the bear is nice."}
{"nr": 1722, "rule": "If Harry is not green then Harry is big."}
{"nr": 18226, "rule": "If something is cold and round then it needs the bear."}
{"nr": 22956, "rule": "If something sees the lion then it is blue."}
{"nr": 8455, "rule": "If Charlie is kind and Charlie is nice then Charlie is white."}
{"nr": 13213, "rule": "If something is round and not big then it likes the cat."}
{"nr": 1764, "rule": "If something is big then it eats the bald eagle."}
{"nr": 471, "rule": "If something is green and blue then it is rough."}
{"nr": 13623, "rule": "If the cow chases the lion and the cow is kind then the cow eats the tiger."}
{"nr": 26435, "rule": "If someone is smart and red then they are rough."}
{"nr": 5018, "rule": "If something eats the cow and it needs the bear then it needs the tiger."}
{"nr": 15338, "rule": "If someone is rough and they visit the bear then the bear chases the tiger."}
{"nr": 12977, "rule": "If someone is cold and rough then they are young."}
{"nr": 20990, "rule": "If someone visits the cow then they are round."}
{"nr": 25236, "rule": "If the tiger is nice and the tiger visits the dog then the dog visits the cat."}
{"nr": 24390, "rule": "If the squirrel sees the cow and the squirrel needs the rabbit then the cow sees the squirrel."}
{"nr": 22892, "rule": "If something is red and green then it visits the tiger."}
{"nr": 6225, "rule": "If the squirrel needs the bear then the squirrel chases the rabbit."}
{"nr": 23430, "rule": "If the bear visits the cow then the cow eats the squirrel."}
{"nr": 21692, "rule": "If the mouse is not young then the mouse is blue."}
{"nr": 12446, "rule": "If someone chases the dog and they need the cow then the dog is young."}
{"nr": 8739, "rule": "If something is cold then it chases the bald eagle."}
{"nr": 5254, "rule": "If someone is big then they need the tiger."}
{"nr": 15148, "rule": "If Bob is rough then Bob is round."}
{"nr": 7431, "rule": "If someone sees the cat then the cat is blue."}
{"nr": 21219, "rule": "If the squirrel sees the cat then the cat chases the bear."}
{"nr": 11721, "rule": "If something is red then it likes the dog."}
{"nr": 8449, "rule": "If something is nice and kind then it is green."}
{"nr": 706, "rule": "If the bald eagle is not green then the bald eagle needs the tiger."}
{"nr": 15421, "rule": "If something visits the bald eagle then the bald eagle is round."}
{"nr": 13477, "rule": "If something likes the bear and it is green then it likes the dog."}
{"nr": 26418, "rule": "If someone is nice and red then they are furry."}
{"nr": 8756, "rule": "If Gary is smart and Gary is red then Gary is big."}
{"nr": 7992, "rule": "If something is rough and it sees the bald eagle then it is young."}
{"nr": 18630, "rule": "If someone is white and red then they are cold."}
{"nr": 19635, "rule": "If Erin is nice and Erin is smart then Erin is green."}
{"nr": 24006, "rule": "If someone eats the tiger and the tiger is not cold then they need the dog."}
{"nr": 14998, "rule": "If something sees the tiger and the tiger sees the squirrel then it sees the dog."}
{"nr": 4133, "rule": "If Charlie is quiet then Charlie is round."}
{"nr": 18422, "rule": "If Fiona is cold and Fiona is nice then Fiona is rough."}
{"nr": 4498, "rule": "If something is big and not round then it is red."}
{"nr": 8384, "rule": "If something needs the squirrel and the squirrel needs the mouse then it sees the lion."}
{"nr": 6508, "rule": "If someone visits the bald eagle then they are red."}
{"nr": 14776, "rule": "If something needs the mouse then it needs the squirrel."}
{"nr": 11291, "rule": "If something eats the lion and the lion sees the rabbit then it eats the squirrel."}
{"nr": 351, "rule": "If Erin is nice then Erin is smart."}
{"nr": 11885, "rule": "If something is young and not smart then it is quiet."}
{"nr": 17595, "rule": "If someone is nice and young then they are round."}
{"nr": 10700, "rule": "If something eats the dog and the dog eats the squirrel then it is kind."}
{"nr": 20601, "rule": "If someone is white and young then they are smart."}
{"nr": 12206, "rule": "If something likes the bear and it eats the bear then it likes the squirrel."}
{"nr": 15091, "rule": "If something is big then it eats the tiger."}
{"nr": 13782, "rule": "If someone eats the lion then the lion eats the rabbit."}
{"nr": 27110, "rule": "If someone sees the rabbit and they eat the bear then they eat the cow."}
{"nr": 26661, "rule": "If Erin is red and Erin is kind then Erin is furry."}
{"nr": 575, "rule": "If Harry is green and Harry is quiet then Harry is white."}
{"nr": 11918, "rule": "If something is nice and round then it is smart."}
{"nr": 16444, "rule": "If someone is quiet then they are blue."}
{"nr": 10747, "rule": "If someone chases the mouse then they are big."}
{"nr": 2967, "rule": "If something is white then it is furry."}
{"nr": 5516, "rule": "If someone is smart and not red then they are cold."}
{"nr": 21574, "rule": "If someone is white then they are kind."}
{"nr": 13999, "rule": "If something likes the mouse then the mouse is green."}
{"nr": 7307, "rule": "If something chases the cat then it visits the lion."}
{"nr": 18624, "rule": "If the bald eagle chases the dog then the bald eagle eats the dog."}
{"nr": 23339, "rule": "If Erin is cold and Erin is rough then Erin is young."}
{"nr": 14204, "rule": "If something is green and not red then it is young."}
{"nr": 5476, "rule": "If something sees the bald eagle and it is not cold then it is big."}
{"nr": 16850, "rule": "If something chases the bald eagle then the bald eagle eats the cow."}
{"nr": 10041, "rule": "If someone eats the bald eagle then the bald eagle is blue."}
{"nr": 9965, "rule": "If someone is smart then they are cold."}
{"nr": 6192, "rule": "If the cat is red then the cat is nice."}
{"nr": 22192, "rule": "If something is blue then it chases the cat."}
{"nr": 7019, "rule": "If someone is kind and young then they are big."}
{"nr": 21026, "rule": "If something is round then it eats the lion."}
{"nr": 17134, "rule": "If someone sees the bald eagle then the bald eagle likes the rabbit."}
{"nr": 19070, "rule": "If something chases the tiger and it chases the dog then the dog likes the tiger."}
{"nr": 25525, "rule": "If something chases the cat and it does not need the cat then it is young."}
{"nr": 21824, "rule": "If something likes the rabbit and it sees the rabbit then the rabbit is big."}
{"nr": 24990, "rule": "If something is rough then it is kind."}
{"nr": 9928, "rule": "If someone likes the cat and they are nice then the cat chases the squirrel."}
{"nr": 11266, "rule": "If someone is rough and not blue then they are young."}
{"nr": 3912, "rule": "If Fiona is smart and Fiona is round then Fiona is green."}
{"nr": 24447, "rule": "If something is white then it is furry."}
{"nr": 20604, "rule": "If someone is young then they are round."}
{"nr": 24567, "rule": "If the rabbit chases the squirrel then the rabbit needs the squirrel."}
{"nr": 16563, "rule": "If something needs the bald eagle and the bald eagle is rough then it chases the squirrel."}
{"nr": 3735, "rule": "If the bald eagle eats the cat and the bald eagle likes the cat then the cat likes the bald eagle."}
{"nr": 26229, "rule": "If something sees the mouse then the mouse eats the squirrel."}
{"nr": 5232, "rule": "If something is round and not green then it is big."}
{"nr": 2939, "rule": "If someone is big then they are nice."}
{"nr": 25445, "rule": "If something is big and cold then it is young."}
{"nr": 23501, "rule": "If something is young then it is big."}
{"nr": 9144, "rule": "If the lion sees the squirrel then the lion eats the squirrel."}
{"nr": 26648, "rule": "If Erin is big then Erin is furry."}
{"nr": 24952, "rule": "If someone is red then they chase the dog."}
{"nr": 6879, "rule": "If someone likes the tiger then the tiger likes the lion."}
{"nr": 7525, "rule": "If Dave is smart and Dave is quiet then Dave is white."}
{"nr": 15012, "rule": "If Harry is cold then Harry is red."}
{"nr": 24216, "rule": "If someone likes the tiger and the tiger sees the bear then they chase the lion."}
{"nr": 20354, "rule": "If Erin is blue then Erin is furry."}
{"nr": 5419, "rule": "If someone is white then they are nice."}
{"nr": 9284, "rule": "If something is blue and furry then it is rough."}
{"nr": 27146, "rule": "If someone likes the bald eagle then the bald eagle is kind."}
{"nr": 22661, "rule": "If something eats the dog then the dog likes the cow."}
{"nr": 4324, "rule": "If the cat is nice then the cat chases the bald eagle."}
{"nr": 23746, "rule": "If something is quiet and green then it is round."}
{"nr": 20546, "rule": "If something is kind then it is white."}
{"nr": 2638, "rule": "If something is big then it is smart."}
{"nr": 20947, "rule": "If Fiona is rough then Fiona is quiet."}
{"nr": 6110, "rule": "If something sees the tiger then the tiger needs the bald eagle."}
{"nr": 23897, "rule": "If someone sees the mouse then the mouse needs the tiger."}
{"nr": 19053, "rule": "If Fiona is big then Fiona is furry."}
{"nr": 21121, "rule": "If someone is green then they need the squirrel."}
{"nr": 26215, "rule": "If Gary is furry and Gary is big then Gary is nice."}
{"nr": 2735, "rule": "If something is white then it is blue."}
{"nr": 25977, "rule": "If the cat is young and the cat is nice then the cat needs the tiger."}
{"nr": 21396, "rule": "If Dave is smart then Dave is white."}
{"nr": 14061, "rule": "If something is blue then it is quiet."}
{"nr": 1054, "rule": "If something needs the bald eagle and it eats the bald eagle then the bald eagle is green."}
{"nr": 18165, "rule": "If someone needs the bear and the bear needs the cow then the cow likes the bear."}
{"nr": 11593, "rule": "If someone chases the dog then the dog chases the tiger."}
{"nr": 150, "rule": "If something chases the rabbit and the rabbit needs the dog then the rabbit visits the dog."}
{"nr": 9911, "rule": "If something likes the rabbit then the rabbit is nice."}
{"nr": 26912, "rule": "If someone is red then they chase the dog."}
{"nr": 3497, "rule": "If someone is cold then they need the cow."}
{"nr": 2146, "rule": "If Bob is big and Bob is kind then Bob is young."}
{"nr": 19428, "rule": "If something eats the lion then the lion is round."}
{"nr": 15763, "rule": "If something is nice and blue then it is furry."}
{"nr": 3056, "rule": "If something needs the squirrel then it is round."}
{"nr": 25147, "rule": "If someone likes the cat then they are big."}
{"nr": 2867, "rule": "If the lion eats the cat then the lion is rough."}
{"nr": 3314, "rule": "If Charlie is blue then Charlie is kind."}
{"nr": 21885, "rule": "If Erin is rough then Erin is smart."}
{"nr": 1509, "rule": "If someone is nice then they are young."}
{"nr": 13110, "rule": "If someone eats the mouse then the mouse eats the rabbit."}
{"nr": 18777, "rule": "If something is round and not green then it is cold."}
{"nr": 8176, "rule": "If something visits the squirrel then the squirrel is blue."}
{"nr": 6281, "rule": "If something visits the mouse then it needs the mouse."}
{"nr": 19278, "rule": "If something is white and blue then it is green."}
{"nr": 17167, "rule": "If something is kind then it is big."}
{"nr": 17550, "rule": "If someone is rough then they are red."}
{"nr": 20686, "rule": "If something is round then it is smart."}
{"nr": 17309, "rule": "If someone is young and blue then they are green."}
{"nr": 17233, "rule": "If something is red and nice then it is blue."}
{"nr": 3826, "rule": "If the dog likes the bald eagle then the bald eagle likes the lion."}
{"nr": 25060, "rule": "If Anne is quiet then Anne is smart."}
{"nr": 6161, "rule": "If someone needs the cat and they are big then they eat the cow."}
{"nr": 15899, "rule": "If something chases the bear then the bear eats the rabbit."}
{"nr": 5543, "rule": "If something sees the tiger then the tiger sees the lion."}
{"nr": 8114, "rule": "If someone is smart and not white then they are round."}
{"nr": 24981, "rule": "If someone is red and they do not need the bear then the bear eats the tiger."}
{"nr": 18047, "rule": "If Fiona is smart and Fiona is young then Fiona is kind."}
{"nr": 24595, "rule": "If something is white then it is green."}
{"nr": 5921, "rule": "If the squirrel likes the lion and the squirrel is green then the lion likes the squirrel."}
{"nr": 10125, "rule": "If the squirrel is big then the squirrel likes the bear."}
{"nr": 169, "rule": "If someone is cold and round then they are big."}
{"nr": 1098, "rule": "If the cow is red and the cow is rough then the cow is young."}
{"nr": 13622, "rule": "If someone eats the lion and the lion likes the tiger then the lion is red."}
{"nr": 21435, "rule": "If something needs the cow then it visits the bald eagle."}
{"nr": 25292, "rule": "If someone visits the mouse then the mouse sees the tiger."}
{"nr": 19447, "rule": "If Gary is furry and Gary is cold then Gary is young."}
{"nr": 24745, "rule": "If the cat likes the mouse and the mouse needs the cat then the cat visits the squirrel."}
{"nr": 17398, "rule": "If something eats the dog and the dog chases the rabbit then it likes the tiger."}
{"nr": 10437, "rule": "If someone is quiet and not white then they are young."}
{"nr": 11268, "rule": "If something visits the rabbit then the rabbit is big."}
{"nr": 21299, "rule": "If the dog is blue and the dog does not eat the lion then the lion needs the bear."}
{"nr": 15831, "rule": "If someone is young and smart then they are quiet."}
{"nr": 7102, "rule": "If something is round and rough then it likes the cow."}
{"nr": 12587, "rule": "If something chases the tiger then it visits the tiger."}
{"nr": 8554, "rule": "If something likes the rabbit and the rabbit needs the lion then the rabbit visits the lion."}
{"nr": 5261, "rule": "If something sees the cat then the cat needs the tiger."}
{"nr": 1531, "rule": "If something is rough and not quiet then it is kind."}
{"nr": 19219, "rule": "If something is young then it is kind."}
{"nr": 777, "rule": "If someone is kind and not big then they are quiet."}
{"nr": 10955, "rule": "If someone likes the dog then they are green."}
{"nr": 9311, "rule": "If someone needs the lion then they are cold."}
{"nr": 3234, "rule": "If something is young and red then it is blue."}
{"nr": 4729, "rule": "If something likes the rabbit and it does not eat the rabbit then it is red."}
{"nr": 1597, "rule": "If someone is smart then they are round."}
{"nr": 20582, "rule": "If Gary is quiet and Gary is big then Gary is smart."}
{"nr": 2300, "rule": "If something chases the squirrel and it is red then the squirrel chases the cow."}
{"nr": 11133, "rule": "If something is nice then it is furry."}
{"nr": 2094, "rule": "If someone eats the bear then they need the tiger."}
{"nr": 18472, "rule": "If Gary is kind then Gary is smart."}
{"nr": 20197, "rule": "If someone sees the squirrel then the squirrel needs the cow."}
{"nr": 10629, "rule": "If something likes the cow and it eats the cow then it eats the cat."}
{"nr": 25075, "rule": "If something is red and it likes the lion then the lion needs the bald eagle."}
{"nr": 9877, "rule": "If Fiona is green and Fiona is kind then Fiona is smart."}
{"nr": 2676, "rule": "If something sees the cat and it is red then the cat chases the lion."}
{"nr": 6476, "rule": "If something sees the lion then the lion sees the tiger."}
{"nr": 23419, "rule": "If something chases the rabbit then it visits the bald eagle."}
{"nr": 13206, "rule": "If the bear visits the tiger then the tiger eats the mouse."}
{"nr": 10624, "rule": "If something chases the cow and it is not big then it is cold."}
{"nr": 26804, "rule": "If something is quiet and kind then it is white."}
{"nr": 14579, "rule": "If the squirrel is blue and the squirrel is nice then the squirrel eats the lion."}
{"nr": 26867, "rule": "If something needs the cat then it likes the bald eagle."}
{"nr": 14648, "rule": "If Charlie is nice and Charlie is round then Charlie is blue."}
{"nr": 10770, "rule": "If something sees the dog then the dog is round."}
{"nr": 13776, "rule": "If someone likes the tiger then they eat the tiger."}
{"nr": 6616, "rule": "If the rabbit is rough and the rabbit needs the squirrel then the squirrel sees the rabbit."}
{"nr": 24251, "rule": "If someone eats the mouse and the mouse eats the bear then they need the mouse."}
{"nr": 10050, "rule": "If someone likes the rabbit then the rabbit chases the mouse."}
{"nr": 18981, "rule": "If the rabbit eats the bald eagle and the rabbit eats the dog then the bald eagle likes the dog."}
{"nr": 13717, "rule": "If something likes the lion then it needs the bear."}
{"nr": 12571, "rule": "If something likes the bear and the bear is kind then the bear chases the squirrel."}
{"nr": 2896, "rule": "If someone visits the cow and the cow is not young then the cow likes the lion."}
{"nr": 25907, "rule": "If something needs the bald eagle and it is nice then the bald eagle chases the tiger."}
{"nr": 7976, "rule": "If someone eats the bear then the bear is green."}
{"nr": 19610, "rule": "If someone is rough then they are kind."}
{"nr": 25857, "rule": "If something is white and young then it is blue."}
{"nr": 22969, "rule": "If someone sees the bald eagle and they are nice then the bald eagle needs the bear."}
{"nr": 2218, "rule": "If Gary is not kind then Gary is white."}
{"nr": 15758, "rule": "If someone likes the tiger then the tiger visits the rabbit."}
{"nr": 17488, "rule": "If someone sees the bald eagle then the bald eagle is blue."}
{"nr": 24400, "rule": "If someone is young then they are white."}
{"nr": 14569, "rule": "If someone is furry and not rough then they are nice."}
{"nr": 19091, "rule": "If someone is rough and they eat the dog then the dog likes the bear."}
{"nr": 18751, "rule": "If someone needs the bald eagle then the bald eagle is cold."}
{"nr": 6850, "rule": "If the tiger does not visit the mouse then the mouse is kind."}
{"nr": 13692, "rule": "If someone is kind and not red then they are white."}
{"nr": 17265, "rule": "If someone is young then they are cold."}
{"nr": 8351, "rule": "If someone sees the squirrel then the squirrel likes the bear."}
{"nr": 25003, "rule": "If something needs the cow then it is big."}
{"nr": 21953, "rule": "If something is kind and it needs the rabbit then it eats the rabbit."}
{"nr": 10972, "rule": "If the squirrel is round and the squirrel is nice then the squirrel is rough."}
{"nr": 10243, "rule": "If something chases the lion and the lion sees the dog then it chases the cat."}
{"nr": 13725, "rule": "If Bob is rough and Bob is round then Bob is green."}
{"nr": 6658, "rule": "If the bald eagle sees the cat then the cat sees the squirrel."}
{"nr": 21436, "rule": "If something visits the bald eagle and it sees the cow then it is young."}
{"nr": 2732, "rule": "If Erin is blue then Erin is green."}
{"nr": 26144, "rule": "If someone chases the bald eagle then the bald eagle visits the dog."}
{"nr": 18942, "rule": "If something is rough then it is blue."}
{"nr": 19102, "rule": "If someone is round then they like the mouse."}
{"nr": 25928, "rule": "If the bald eagle visits the dog then the dog sees the bear."}
{"nr": 24646, "rule": "If something likes the tiger then it sees the tiger."}
{"nr": 6221, "rule": "If something is rough and it chases the mouse then it is blue."}
{"nr": 17820, "rule": "If someone is young and not nice then they are big."}
{"nr": 11045, "rule": "If the bear is green then the bear is round."}
{"nr": 11613, "rule": "If someone is cold and not smart then they are big."}
{"nr": 9191, "rule": "If the cow needs the bear and the bear does not visit the cow then the cow is round."}
{"nr": 15120, "rule": "If something is kind and not green then it is nice."}
{"nr": 3775, "rule": "If the bear needs the rabbit then the bear likes the rabbit."}
{"nr": 20757, "rule": "If something is cold and red then it is nice."}
{"nr": 17024, "rule": "If someone is nice then they chase the rabbit."}
{"nr": 4381, "rule": "If something is green and not round then it is quiet."}
{"nr": 24900, "rule": "If something is blue then it needs the cat."}
{"nr": 8647, "rule": "If something eats the cow then the cow chases the lion."}
{"nr": 2445, "rule": "If something is blue then it is nice."}
{"nr": 12271, "rule": "If Dave is not white then Dave is furry."}
{"nr": 17298, "rule": "If someone likes the bear then the bear sees the squirrel."}
{"nr": 1847, "rule": "If something is rough and it does not need the rabbit then it is round."}
{"nr": 3483, "rule": "If something is kind and not blue then it is quiet."}
{"nr": 8540, "rule": "If something is furry and not young then it is blue."}
{"nr": 27393, "rule": "If someone likes the bear and the bear visits the cow then the bear sees the rabbit."}
{"nr": 25980, "rule": "If someone is smart then they are green."}
{"nr": 9859, "rule": "If Harry is white and Harry is blue then Harry is red."}
{"nr": 22249, "rule": "If someone is red then they like the mouse."}
{"nr": 9443, "rule": "If someone visits the tiger then they are round."}
{"nr": 15246, "rule": "If the dog chases the squirrel and the squirrel chases the dog then the dog sees the squirrel."}
{"nr": 13825, "rule": "If the bear is not kind and the bear is not red then the bear chases the dog."}
{"nr": 761, "rule": "If Erin is kind and Erin is green then Erin is young."}
{"nr": 9592, "rule": "If someone sees the dog and they are not big then the dog sees the squirrel."}
{"nr": 8623, "rule": "If something needs the tiger then the tiger is rough."}
{"nr": 5473, "rule": "If something is nice then it chases the bald eagle."}
{"nr": 22223, "rule": "If Charlie is furry and Charlie is big then Charlie is quiet."}
{"nr": 11034, "rule": "If something visits the bald eagle then the bald eagle likes the rabbit."}
{"nr": 9237, "rule": "If the tiger is blue then the tiger is green."}
{"nr": 18201, "rule": "If something is young and round then it is furry."}
{"nr": 10883, "rule": "If something is nice and it needs the rabbit then it likes the rabbit."}
{"nr": 25638, "rule": "If Fiona is young and Fiona is rough then Fiona is round."}
{"nr": 14691, "rule": "If someone chases the bear and the bear is red then they see the bear."}
{"nr": 12915, "rule": "If the cat does not see the mouse and the mouse does not visit the cat then the mouse sees the cat."}
{"nr": 17456, "rule": "If something is green and not quiet then it is white."}
{"nr": 21615, "rule": "If someone needs the tiger and they are not rough then the tiger sees the bear."}
{"nr": 24810, "rule": "If someone visits the dog then the dog is cold."}
{"nr": 16430, "rule": "If Harry is green and Harry is cold then Harry is blue."}
{"nr": 14077, "rule": "If the cow likes the bear and the cow does not see the mouse then the mouse eats the bear."}
{"nr": 16454, "rule": "If Fiona is smart and Fiona is not nice then Fiona is quiet."}
{"nr": 23878, "rule": "If something is round then it chases the cow."}
{"nr": 23032, "rule": "If something is young then it is blue."}
{"nr": 21606, "rule": "If something likes the dog and it eats the squirrel then the squirrel eats the cat."}
{"nr": 4629, "rule": "If Anne is quiet then Anne is rough."}
{"nr": 21748, "rule": "If something is round then it is furry."}
{"nr": 14629, "rule": "If the bear is rough then the bear is nice."}
{"nr": 9183, "rule": "If someone is red and round then they chase the cow."}
{"nr": 17007, "rule": "If something is rough then it needs the rabbit."}
{"nr": 14298, "rule": "If someone is cold then they are kind."}
{"nr": 18993, "rule": "If something is young and big then it needs the cow."}
{"nr": 2164, "rule": "If the cat needs the rabbit and the cat visits the rabbit then the rabbit is round."}
{"nr": 26148, "rule": "If someone visits the dog and the dog is cold then the dog is round."}
{"nr": 10059, "rule": "If someone is smart and white then they are nice."}
{"nr": 6713, "rule": "If Erin is white and Erin is blue then Erin is kind."}
{"nr": 802, "rule": "If Erin is rough then Erin is blue."}
{"nr": 25721, "rule": "If something is young and not quiet then it is blue."}
{"nr": 27194, "rule": "If something is round then it is cold."}
{"nr": 26964, "rule": "If something is green and cold then it is kind."}
{"nr": 19153, "rule": "If something eats the cow and it does not need the tiger then it eats the tiger."}
{"nr": 13486, "rule": "If someone is cold and smart then they are round."}
{"nr": 6987, "rule": "If something needs the bald eagle and it is not round then it is green."}
{"nr": 8888, "rule": "If something eats the tiger then it chases the rabbit."}
{"nr": 15099, "rule": "If something chases the dog and it chases the tiger then it sees the dog."}
{"nr": 10459, "rule": "If something likes the rabbit then it sees the rabbit."}
{"nr": 17421, "rule": "If Anne is white and Anne is furry then Anne is young."}
{"nr": 26522, "rule": "If someone eats the lion and they eat the mouse then the mouse is round."}
{"nr": 11183, "rule": "If Gary is big and Gary is not kind then Gary is round."}
{"nr": 23163, "rule": "If someone is smart and kind then they are white."}
{"nr": 25581, "rule": "If something is smart and round then it is kind."}
{"nr": 15437, "rule": "If someone likes the squirrel then they eat the squirrel."}
{"nr": 11723, "rule": "If something is blue and it likes the dog then it likes the bald eagle."}
{"nr": 22655, "rule": "If someone is young and they like the tiger then they chase the dog."}
{"nr": 22751, "rule": "If something eats the tiger then it eats the bear."}
{"nr": 21306, "rule": "If the lion sees the cat and the cat chases the dog then the lion eats the dog."}
{"nr": 7684, "rule": "If something sees the mouse and it sees the rabbit then the rabbit chases the mouse."}
{"nr": 16085, "rule": "If someone eats the lion and the lion visits the bald eagle then the bald eagle sees the cat."}
{"nr": 7727, "rule": "If someone is smart then they are green."}
{"nr": 6469, "rule": "If something is quiet then it is big."}
{"nr": 25387, "rule": "If someone is round then they are quiet."}
{"nr": 22644, "rule": "If someone is big then they are kind."}
{"nr": 8356, "rule": "If someone is round and they like the bear then the bear likes the squirrel."}
{"nr": 25191, "rule": "If someone chases the bear then the bear is big."}
{"nr": 2791, "rule": "If Bob is quiet and Bob is white then Bob is rough."}
{"nr": 24378, "rule": "If something is round and it likes the cat then it sees the cat."}
{"nr": 1606, "rule": "If something needs the dog and it does not need the rabbit then it is green."}
{"nr": 3547, "rule": "If Anne is rough and Anne is red then Anne is big."}
{"nr": 2290, "rule": "If the cat is kind then the cat is cold."}
{"nr": 322, "rule": "If someone is young then they are furry."}
{"nr": 18931, "rule": "If someone is furry then they are nice."}
{"nr": 6371, "rule": "If someone is green then they are blue."}
{"nr": 10519, "rule": "If someone visits the squirrel and they eat the bear then the bear eats the squirrel."}
{"nr": 3271, "rule": "If Dave is furry then Dave is cold."}
{"nr": 6931, "rule": "If Bob is cold then Bob is white."}
{"nr": 466, "rule": "If someone is white and furry then they are blue."}
{"nr": 9941, "rule": "If someone is green and cold then they are young."}
{"nr": 23514, "rule": "If someone is young then they need the mouse."}
{"nr": 21087, "rule": "If someone is kind and they eat the tiger then they see the cow."}
{"nr": 17118, "rule": "If someone sees the cat and they do not visit the lion then the lion visits the dog."}
{"nr": 2878, "rule": "If the lion is not red then the lion chases the squirrel."}
{"nr": 22418, "rule": "If someone chases the lion then the lion is nice."}
{"nr": 22625, "rule": "If someone likes the lion and the lion is cold then they see the bald eagle."}
{"nr": 781, "rule": "If someone is big and not green then they are cold."}
{"nr": 335, "rule": "If something chases the rabbit then the rabbit chases the cat."}
{"nr": 24754, "rule": "If something chases the mouse then it sees the lion."}
{"nr": 25623, "rule": "If the cow likes the bear and the bear is cold then the cow is kind."}
{"nr": 18888, "rule": "If someone visits the cow then they chase the dog."}
{"nr": 601, "rule": "If Bob is cold and Bob is green then Bob is furry."}
{"nr": 824, "rule": "If something is round and quiet then it is white."}
{"nr": 24618, "rule": "If the cow chases the lion and the lion does not chase the cow then the cow likes the rabbit."}
{"nr": 12545, "rule": "If something visits the cow then the cow is round."}
{"nr": 24904, "rule": "If Harry is red and Harry is blue then Harry is white."}
{"nr": 13095, "rule": "If Dave is quiet and Dave is young then Dave is green."}
{"nr": 841, "rule": "If someone is big and they do not like the dog then they are nice."}
{"nr": 23316, "rule": "If Dave is cold then Dave is furry."}
{"nr": 19779, "rule": "If someone is kind and big then they chase the lion."}
{"nr": 8146, "rule": "If someone needs the cat then the cat needs the cow."}
{"nr": 5007, "rule": "If the cat is green and the cat is young then the cat is cold."}
{"nr": 4535, "rule": "If something is kind then it likes the bald eagle."}
{"nr": 24393, "rule": "If something needs the bear then it is red."}
{"nr": 6840, "rule": "If the cow visits the bear and the bear sees the cow then the bear visits the cow."}
{"nr": 8704, "rule": "If something is round and not kind then it is red."}
{"nr": 24493, "rule": "If someone is nice and they eat the lion then they eat the squirrel."}
{"nr": 11507, "rule": "If someone eats the cow and they visit the cat then the cow likes the tiger."}
{"nr": 16192, "rule": "If something sees the bald eagle and it sees the bear then the bear visits the bald eagle."}
{"nr": 12217, "rule": "If someone likes the rabbit then they see the rabbit."}
{"nr": 18220, "rule": "If Dave is blue then Dave is quiet."}
{"nr": 3774, "rule": "If someone needs the bear and the bear is rough then the bear likes the rabbit."}
{"nr": 17110, "rule": "If someone is smart and not nice then they are young."}
{"nr": 18656, "rule": "If Charlie is red and Charlie is white then Charlie is young."}
{"nr": 21224, "rule": "If someone is cold and young then they are white."}
{"nr": 26275, "rule": "If something is blue then it is red."}
{"nr": 11058, "rule": "If something is cold and it visits the tiger then it sees the mouse."}
{"nr": 10259, "rule": "If something sees the cat then the cat needs the dog."}
{"nr": 13696, "rule": "If someone needs the mouse and they visit the mouse then they like the mouse."}
{"nr": 3843, "rule": "If Gary is blue then Gary is rough."}
{"nr": 1506, "rule": "If something likes the bear and it does not need the squirrel then it is kind."}
{"nr": 4426, "rule": "If something is nice then it is quiet."}
{"nr": 18620, "rule": "If someone likes the bald eagle then they chase the dog."}
{"nr": 17397, "rule": "If something is blue then it eats the rabbit."}
{"nr": 25673, "rule": "If Anne is cold and Anne is young then Anne is nice."}
{"nr": 22071, "rule": "If someone visits the mouse and the mouse is cold then the mouse visits the bear."}
{"nr": 2660, "rule": "If the bald eagle needs the rabbit and the bald eagle is red then the bald eagle chases the cow."}
{"nr": 486, "rule": "If someone is kind and green then they are blue."}
{"nr": 7814, "rule": "If someone is red and they like the tiger then they eat the tiger."}
{"nr": 3957, "rule": "If Charlie is quiet and Charlie is green then Charlie is young."}
{"nr": 23199, "rule": "If something is big and kind then it is rough."}
{"nr": 19952, "rule": "If something is white then it is red."}
{"nr": 15176, "rule": "If someone is round and they eat the lion then they are young."}
{"nr": 26313, "rule": "If the rabbit chases the dog and the dog chases the rabbit then the rabbit is nice."}
{"nr": 4496, "rule": "If the bear visits the tiger then the tiger visits the cat."}
{"nr": 24566, "rule": "If someone chases the rabbit then they see the bear."}
{"nr": 2010, "rule": "If someone is rough then they are nice."}
{"nr": 10440, "rule": "If something is red and not quiet then it is young."}
{"nr": 9575, "rule": "If Gary is not red then Gary is blue."}
{"nr": 26369, "rule": "If something is quiet and nice then it is young."}
{"nr": 22048, "rule": "If something is big then it is white."}
{"nr": 12375, "rule": "If someone needs the bear then the bear needs the mouse."}
{"nr": 2201, "rule": "If Anne is green then Anne is blue."}
{"nr": 3548, "rule": "If someone is green and white then they are red."}
{"nr": 12799, "rule": "If someone sees the lion and they visit the bear then the lion visits the bear."}
{"nr": 25228, "rule": "If the lion is not green and the lion is not nice then the lion likes the bald eagle."}
{"nr": 26192, "rule": "If someone visits the tiger then they like the tiger."}
{"nr": 1567, "rule": "If Bob is big then Bob is round."}
{"nr": 8149, "rule": "If someone likes the cow then the cow sees the cat."}
{"nr": 14376, "rule": "If something likes the tiger then it visits the squirrel."}
{"nr": 779, "rule": "If someone is quiet and not kind then they are green."}
{"nr": 9367, "rule": "If the cow does not chase the bald eagle then the cow eats the bear."}
{"nr": 27349, "rule": "If someone is kind then they are red."}
{"nr": 6650, "rule": "If someone is red then they are furry."}
{"nr": 18294, "rule": "If Dave is round and Dave is big then Dave is blue."}
{"nr": 3681, "rule": "If something needs the squirrel and it sees the cat then the cat sees the cow."}
{"nr": 13663, "rule": "If someone is blue and furry then they are green."}
{"nr": 7430, "rule": "If someone sees the cat then they eat the tiger."}
{"nr": 26218, "rule": "If Dave is white and Dave is green then Dave is round."}
{"nr": 10947, "rule": "If someone needs the lion then the lion needs the tiger."}
{"nr": 26359, "rule": "If something is green and it does not like the squirrel then the squirrel is red."}
{"nr": 17874, "rule": "If something is round then it likes the tiger."}
{"nr": 25117, "rule": "If something is red then it eats the dog."}
{"nr": 15194, "rule": "If the lion does not chase the cow then the lion chases the cat."}
{"nr": 17606, "rule": "If something chases the dog then it chases the lion."}
{"nr": 6468, "rule": "If something is kind then it is young."}
{"nr": 3748, "rule": "If someone is green and white then they are furry."}
{"nr": 23240, "rule": "If someone is cold and they like the rabbit then the rabbit likes the cat."}
{"nr": 15817, "rule": "If something is quiet then it is nice."}
{"nr": 2545, "rule": "If something is blue then it is nice."}
{"nr": 4593, "rule": "If something is cold then it chases the bear."}
{"nr": 20112, "rule": "If someone is smart then they are quiet."}
{"nr": 10549, "rule": "If someone is kind then they see the cow."}
{"nr": 3640, "rule": "If someone is young and rough then they are cold."}
{"nr": 15580, "rule": "If someone is blue then they visit the squirrel."}
{"nr": 18209, "rule": "If Charlie is quiet and Charlie is nice then Charlie is young."}
{"nr": 14917, "rule": "If something is green and blue then it is nice."}
{"nr": 1402, "rule": "If someone is white and rough then they are quiet."}
{"nr": 12473, "rule": "If someone is blue then they are quiet."}
{"nr": 20793, "rule": "If something visits the squirrel and it does not chase the mouse then the mouse chases the squirrel."}
{"nr": 22752, "rule": "If something is rough then it eats the bear."}
{"nr": 10371, "rule": "If something sees the bear and it is rough then the bear chases the tiger."}
{"nr": 16255, "rule": "If Dave is young then Dave is big."}
{"nr": 25694, "rule": "If the lion likes the cat then the cat eats the mouse."}
{"nr": 17216, "rule": "If someone likes the lion then they are green."}
{"nr": 19851, "rule": "If Fiona is kind then Fiona is cold."}
{"nr": 8431, "rule": "If someone likes the rabbit then they are green."}
{"nr": 27281, "rule": "If Anne is smart then Anne is furry."}
{"nr": 17432, "rule": "If something is blue then it is white."}
{"nr": 4086, "rule": "If something likes the cow then the cow sees the bald eagle."}
{"nr": 13495, "rule": "If Fiona is furry and Fiona is rough then Fiona is round."}
{"nr": 11209, "rule": "If someone eats the tiger then they eat the bald eagle."}
{"nr": 3514, "rule": "If someone is round then they eat the dog."}
{"nr": 3927, "rule": "If someone is cold and young then they are green."}
{"nr": 12245, "rule": "If something likes the cat then the cat likes the bald eagle."}
{"nr": 7063, "rule": "If someone eats the rabbit then they chase the rabbit."}
{"nr": 17429, "rule": "If something is round then it is cold."}
{"nr": 7065, "rule": "If someone is rough and young then they chase the bald eagle."}
{"nr": 17893, "rule": "If someone chases the cow then they like the tiger."}
{"nr": 14472, "rule": "If something sees the bald eagle then it visits the bald eagle."}
{"nr": 16505, "rule": "If something is young and round then it is cold."}
{"nr": 4987, "rule": "If something likes the mouse then it chases the dog."}
{"nr": 4344, "rule": "If someone sees the mouse then the mouse eats the cat."}
{"nr": 265, "rule": "If someone is kind and furry then they are big."}
{"nr": 14067, "rule": "If something is cold then it is rough."}
{"nr": 20513, "rule": "If Bob is red and Bob is nice then Bob is green."}
{"nr": 16465, "rule": "If someone is smart and white then they are young."}
{"nr": 12329, "rule": "If Fiona is white then Fiona is nice."}
{"nr": 4788, "rule": "If Harry is furry then Harry is nice."}
{"nr": 6138, "rule": "If Dave is young then Dave is big."}
{"nr": 4161, "rule": "If someone is green and not blue then they are smart."}
{"nr": 8510, "rule": "If something is young and it does not see the lion then it eats the rabbit."}
{"nr": 19801, "rule": "If someone needs the lion and they visit the lion then they are nice."}
{"nr": 20703, "rule": "If something likes the tiger then it is blue."}
{"nr": 25918, "rule": "If the cow eats the bear then the bear is round."}
{"nr": 25793, "rule": "If someone is rough then they are nice."}
{"nr": 23857, "rule": "If something is young and not green then it is quiet."}
{"nr": 18738, "rule": "If something is nice then it is smart."}
{"nr": 4828, "rule": "If Harry is kind and Harry is big then Harry is nice."}
{"nr": 1250, "rule": "If Fiona is not blue then Fiona is green."}
{"nr": 4266, "rule": "If Erin is smart then Erin is big."}
{"nr": 16171, "rule": "If something visits the bear and it likes the bear then the bear likes the lion."}
{"nr": 25766, "rule": "If someone is young then they are nice."}
{"nr": 4409, "rule": "If something is red then it eats the lion."}
{"nr": 14820, "rule": "If something sees the mouse then it is cold."}
{"nr": 17670, "rule": "If something is cold then it is quiet."}
{"nr": 624, "rule": "If Harry is young and Harry is not nice then Harry is furry."}
{"nr": 13321, "rule": "If someone is nice and cold then they are kind."}
{"nr": 18989, "rule": "If the rabbit needs the squirrel then the squirrel is young."}
{"nr": 17787, "rule": "If someone is young then they are kind."}
{"nr": 4052, "rule": "If someone is young and not rough then they like the cat."}
{"nr": 26014, "rule": "If someone is big then they eat the cow."}
{"nr": 11039, "rule": "If something needs the rabbit and it likes the bald eagle then the bald eagle is round."}
{"nr": 26616, "rule": "If someone is green then they chase the cow."}
{"nr": 24246, "rule": "If someone eats the mouse then they are green."}
{"nr": 7741, "rule": "If something is white and rough then it is kind."}
{"nr": 17461, "rule": "If something is young and smart then it is blue."}
{"nr": 7739, "rule": "If something is nice then it likes the mouse."}
{"nr": 6423, "rule": "If something needs the rabbit and it visits the bear then the rabbit is round."}
{"nr": 12292, "rule": "If something chases the squirrel then it is round."}
{"nr": 13753, "rule": "If someone visits the rabbit then they are round."}
{"nr": 12270, "rule": "If Bob is white and Bob is furry then Bob is cold."}
{"nr": 22854, "rule": "If someone is young then they are cold."}
{"nr": 3022, "rule": "If Charlie is rough and Charlie is kind then Charlie is nice."}
{"nr": 7644, "rule": "If the tiger sees the mouse then the tiger sees the cow."}
{"nr": 19990, "rule": "If something eats the squirrel and it sees the bear then the bear eats the rabbit."}
{"nr": 12605, "rule": "If something is blue then it needs the tiger."}
{"nr": 19312, "rule": "If something sees the rabbit and it sees the cat then the rabbit sees the tiger."}
{"nr": 13687, "rule": "If Bob is green and Bob is rough then Bob is nice."}
{"nr": 22477, "rule": "If someone is green and they do not chase the tiger then they are blue."}
{"nr": 3680, "rule": "If something is young then it sees the squirrel."}
{"nr": 16524, "rule": "If something is young and not round then it is white."}
{"nr": 11476, "rule": "If someone sees the cow then the cow needs the mouse."}
{"nr": 11220, "rule": "If something chases the squirrel and it is cold then the squirrel chases the rabbit."}
{"nr": 22975, "rule": "If someone sees the bear then they are nice."}
{"nr": 8855, "rule": "If someone needs the cow and they need the cat then the cow sees the dog."}
{"nr": 21169, "rule": "If someone is green and they visit the rabbit then the rabbit chases the tiger."}
{"nr": 5005, "rule": "If the tiger is red and the tiger does not eat the bear then the bear is rough."}
{"nr": 6283, "rule": "If the rabbit needs the bald eagle and the rabbit likes the mouse then the mouse likes the bald eagle."}
{"nr": 13897, "rule": "If someone is rough then they are red."}
{"nr": 348, "rule": "If Anne is rough then Anne is round."}
{"nr": 18155, "rule": "If someone is young and rough then they are smart."}
{"nr": 15214, "rule": "If someone likes the bear then they are blue."}
{"nr": 17425, "rule": "If something is young then it eats the mouse."}
{"nr": 15088, "rule": "If something likes the rabbit and it is blue then it is nice."}
{"nr": 20257, "rule": "If someone is quiet then they are young."}
{"nr": 15328, "rule": "If something is young then it likes the rabbit."}
{"nr": 19783, "rule": "If something is cold and rough then it is white."}
{"nr": 6311, "rule": "If someone is big and kind then they are red."}
{"nr": 13715, "rule": "If the cow eats the squirrel then the squirrel is round."}
{"nr": 9094, "rule": "If the bald eagle chases the dog and the dog chases the bald eagle then the dog likes the bald eagle."}
{"nr": 22231, "rule": "If Harry is furry and Harry is cold then Harry is blue."}
{"nr": 14355, "rule": "If someone is big and rough then they like the cat."}
{"nr": 8077, "rule": "If someone visits the cat then they are big."}
{"nr": 18291, "rule": "If something is cold then it is red."}
{"nr": 14587, "rule": "If someone eats the dog then they eat the bear."}
{"nr": 13301, "rule": "If someone is young and green then they are cold."}
{"nr": 22770, "rule": "If someone visits the tiger and they are not kind then the tiger is blue."}
{"nr": 26796, "rule": "If someone chases the bear and they see the bear then the bear likes the mouse."}
{"nr": 11028, "rule": "If someone visits the bear then the bear eats the rabbit."}
{"nr": 14893, "rule": "If Charlie is young and Charlie is not furry then Charlie is rough."}
{"nr": 17248, "rule": "If someone visits the cow then they are nice."}
{"nr": 12796, "rule": "If someone sees the bear then they are cold."}
{"nr": 18039, "rule": "If something likes the dog then the dog is rough."}
{"nr": 16733, "rule": "If Charlie is round and Charlie is nice then Charlie is young."}
{"nr": 5300, "rule": "If the dog sees the mouse and the dog is not big then the mouse visits the bear."}
{"nr": 26213, "rule": "If someone is round and not big then they are kind."}
{"nr": 9041, "rule": "If someone is nice then they are quiet."}
{"nr": 25344, "rule": "If something is kind and it sees the dog then the dog needs the cow."}
{"nr": 8174, "rule": "If someone eats the tiger and they are blue then the tiger is rough."}
{"nr": 25559, "rule": "If someone is cold then they are kind."}
{"nr": 1289, "rule": "If Gary is quiet then Gary is furry."}
{"nr": 21351, "rule": "If someone is white then they are blue."}
{"nr": 9492, "rule": "If Charlie is red and Charlie is smart then Charlie is rough."}
{"nr": 20181, "rule": "If someone is furry and young then they are red."}
{"nr": 13296, "rule": "If something needs the cow and the cow visits the bald eagle then the bald eagle is green."}
{"nr": 3322, "rule": "If someone is blue and they see the bear then the bear is cold."}
{"nr": 18799, "rule": "If someone is big then they are red."}
{"nr": 6435, "rule": "If something needs the dog and it does not visit the lion then the lion chases the dog."}
{"nr": 13814, "rule": "If something chases the tiger then it is green."}
{"nr": 11015, "rule": "If someone chases the bear then the bear chases the cat."}
{"nr": 11518, "rule": "If someone visits the cat then they chase the rabbit."}
{"nr": 7059, "rule": "If Fiona is furry then Fiona is red."}
{"nr": 19399, "rule": "If something needs the bald eagle and the bald eagle chases the rabbit then the bald eagle is blue."}
{"nr": 17288, "rule": "If something is round and smart then it is red."}
{"nr": 3532, "rule": "If someone is young then they are big."}
{"nr": 20718, "rule": "If something is green and cold then it is rough."}
{"nr": 22242, "rule": "If something is furry and smart then it is quiet."}
{"nr": 27100, "rule": "If someone chases the cat then they are rough."}
{"nr": 18421, "rule": "If something is furry then it is kind."}
{"nr": 24847, "rule": "If someone is blue and furry then they are nice."}
{"nr": 23546, "rule": "If someone is quiet then they are kind."}
{"nr": 19180, "rule": "If something is rough then it visits the bear."}
{"nr": 25255, "rule": "If someone is red then they are quiet."}
{"nr": 1737, "rule": "If someone chases the mouse then they are cold."}
{"nr": 24960, "rule": "If someone sees the cow then the cow chases the mouse."}
{"nr": 4061, "rule": "If something is red then it is nice."}
{"nr": 5104, "rule": "If the dog sees the squirrel then the dog sees the lion."}
{"nr": 11302, "rule": "If something is quiet and not round then it is red."}
{"nr": 16212, "rule": "If something is green and it visits the mouse then it chases the lion."}
{"nr": 7606, "rule": "If Fiona is smart then Fiona is quiet."}
{"nr": 2098, "rule": "If the lion is cold and the lion is nice then the lion is round."}
{"nr": 26179, "rule": "If something likes the rabbit and the rabbit is cold then the rabbit eats the dog."}
{"nr": 18356, "rule": "If something is cold then it is red."}
{"nr": 15188, "rule": "If someone is round and not quiet then they are big."}
{"nr": 19775, "rule": "If someone chases the lion then the lion is kind."}
{"nr": 4956, "rule": "If the cow is kind and the cow is red then the cow is nice."}
{"nr": 541, "rule": "If Anne is blue and Anne is furry then Anne is cold."}
{"nr": 11786, "rule": "If the cow is nice then the cow is red."}
{"nr": 10094, "rule": "If the cat likes the cow then the cat chases the cow."}
{"nr": 23761, "rule": "If Gary is cold and Gary is red then Gary is furry."}
{"nr": 24145, "rule": "If something is quiet and green then it is white."}
{"nr": 25951, "rule": "If something is nice and it needs the lion then the lion likes the mouse."}
{"nr": 27023, "rule": "If something is furry then it is young."}
{"nr": 26762, "rule": "If something chases the cow then the cow likes the bear."}
{"nr": 10049, "rule": "If the squirrel likes the rabbit then the squirrel is cold."}
{"nr": 20558, "rule": "If someone likes the mouse then they chase the squirrel."}
{"nr": 17156, "rule": "If someone likes the rabbit then they are round."}
{"nr": 17949, "rule": "If something is big and young then it is rough."}
{"nr": 21437, "rule": "If something is cold then it sees the cow."}
{"nr": 27442, "rule": "If someone is kind and white then they are smart."}
{"nr": 23229, "rule": "If someone sees the cow then the cow visits the cat."}
{"nr": 6922, "rule": "If someone likes the bald eagle and the bald eagle sees the squirrel then they are kind."}
{"nr": 15782, "rule": "If something is young and not green then it is rough."}
{"nr": 1187, "rule": "If someone chases the dog and they eat the lion then the dog visits the rabbit."}
{"nr": 22396, "rule": "If something sees the bald eagle then it needs the dog."}
{"nr": 4889, "rule": "If the mouse likes the bear and the mouse does not eat the bear then the mouse is red."}
{"nr": 13497, "rule": "If the dog sees the lion and the dog is cold then the dog is rough."}
{"nr": 19074, "rule": "If something visits the dog then the dog is green."}
{"nr": 4093, "rule": "If someone is kind and not young then they are rough."}
{"nr": 5414, "rule": "If the mouse chases the rabbit then the mouse likes the rabbit."}
{"nr": 6553, "rule": "If something chases the bear then the bear is kind."}
{"nr": 15921, "rule": "If the mouse eats the dog then the mouse sees the dog."}
{"nr": 14246, "rule": "If Anne is quiet then Anne is red."}
{"nr": 15706, "rule": "If the rabbit visits the mouse then the mouse is young."}
{"nr": 21043, "rule": "If something is smart and quiet then it is cold."}
{"nr": 9348, "rule": "If the bear is cold and the bear is blue then the bear is rough."}
{"nr": 22401, "rule": "If someone is kind then they are big."}
{"nr": 15920, "rule": "If the cat is rough then the cat needs the rabbit."}
{"nr": 22076, "rule": "If someone visits the cat and they see the lion then they see the tiger."}
{"nr": 4589, "rule": "If someone is white then they are round."}
{"nr": 20163, "rule": "If someone sees the lion then they see the cat."}
{"nr": 20883, "rule": "If something sees the rabbit then the rabbit likes the mouse."}
{"nr": 14580, "rule": "If something is nice and it eats the lion then it eats the cat."}
{"nr": 3230, "rule": "If something is blue then it is round."}
{"nr": 13708, "rule": "If Erin is big and Erin is not red then Erin is cold."}
{"nr": 2111, "rule": "If something chases the mouse and the mouse is rough then the mouse chases the tiger."}
{"nr": 5366, "rule": "If something needs the rabbit then the rabbit needs the bald eagle."}
{"nr": 1092, "rule": "If something visits the rabbit and the rabbit chases the bear then the rabbit visits the dog."}
{"nr": 7515, "rule": "If something is big then it sees the lion."}
{"nr": 11088, "rule": "If Bob is young and Bob is not furry then Bob is nice."}
{"nr": 24039, "rule": "If Dave is white then Dave is big."}
{"nr": 7944, "rule": "If Gary is rough then Gary is furry."}
{"nr": 25632, "rule": "If something is rough and it sees the tiger then it is big."}
{"nr": 7331, "rule": "If Erin is kind then Erin is round."}
{"nr": 15166, "rule": "If something is nice and it eats the rabbit then it is round."}
{"nr": 26026, "rule": "If the bald eagle is nice and the bald eagle sees the lion then the lion eats the bald eagle."}
{"nr": 19571, "rule": "If Fiona is quiet then Fiona is blue."}
{"nr": 21381, "rule": "If someone visits the dog then they are cold."}
{"nr": 10535, "rule": "If something likes the dog and it visits the dog then the dog likes the lion."}
{"nr": 18611, "rule": "If the lion chases the squirrel and the lion visits the squirrel then the squirrel needs the lion."}
{"nr": 8374, "rule": "If someone is blue and they see the mouse then the mouse is young."}
{"nr": 8460, "rule": "If something is smart then it is quiet."}
{"nr": 19861, "rule": "If someone visits the cow and they are round then the cow is round."}
{"nr": 18149, "rule": "If Gary is quiet then Gary is round."}
{"nr": 1387, "rule": "If something needs the tiger and the tiger eats the bear then the bear needs the tiger."}
{"nr": 8940, "rule": "If something visits the rabbit and it is big then the rabbit is green."}
{"nr": 20750, "rule": "If someone is big and they do not like the dog then the dog likes the mouse."}
{"nr": 19737, "rule": "If someone needs the squirrel then they need the bear."}
{"nr": 17859, "rule": "If Dave is green then Dave is quiet."}
{"nr": 223, "rule": "If the mouse visits the squirrel and the mouse is kind then the mouse chases the lion."}
{"nr": 9740, "rule": "If someone chases the tiger and they are blue then they see the tiger."}
{"nr": 9302, "rule": "If someone eats the bear then they visit the bear."}
{"nr": 12708, "rule": "If the tiger chases the bald eagle then the tiger sees the bald eagle."}
{"nr": 2988, "rule": "If someone visits the bear then the bear is blue."}
{"nr": 26859, "rule": "If someone is green then they are furry."}
{"nr": 4765, "rule": "If something chases the cat and the cat sees the mouse then the mouse is nice."}
{"nr": 24959, "rule": "If someone chases the lion and they eat the mouse then the lion eats the cat."}
{"nr": 8488, "rule": "If someone is green then they visit the bald eagle."}
{"nr": 16772, "rule": "If something visits the bear and the bear visits the tiger then the tiger is nice."}
{"nr": 14897, "rule": "If something is nice then it is kind."}
{"nr": 8932, "rule": "If someone is big then they are smart."}
{"nr": 21159, "rule": "If someone needs the dog then they eat the dog."}
{"nr": 5304, "rule": "If Charlie is white and Charlie is blue then Charlie is round."}
{"nr": 11960, "rule": "If someone is nice then they are young."}
{"nr": 22705, "rule": "If Gary is white then Gary is nice."}
{"nr": 24546, "rule": "If something is cold and round then it sees the mouse."}
{"nr": 14324, "rule": "If someone is rough then they are cold."}
{"nr": 17842, "rule": "If something is big then it is cold."}
{"nr": 18019, "rule": "If something is kind then it is young."}
{"nr": 27344, "rule": "If someone is red then they are white."}
{"nr": 5314, "rule": "If someone needs the bear and they are not big then the bear likes the bald eagle."}
{"nr": 15904, "rule": "If someone is white then they are smart."}
{"nr": 16075, "rule": "If Fiona is blue then Fiona is cold."}
{"nr": 7858, "rule": "If someone eats the lion then they need the squirrel."}
{"nr": 13587, "rule": "If something is cold and big then it likes the lion."}
{"nr": 4054, "rule": "If the lion eats the dog then the lion chases the cat."}
{"nr": 6217, "rule": "If someone is nice and young then they are red."}
{"nr": 14315, "rule": "If something is cold then it is furry."}
{"nr": 5499, "rule": "If something is cold then it is rough."}
{"nr": 10846, "rule": "If the mouse is green and the mouse likes the squirrel then the squirrel is kind."}
{"nr": 13930, "rule": "If someone is round and young then they are big."}
{"nr": 5461, "rule": "If the bald eagle likes the dog then the dog likes the rabbit."}
{"nr": 8308, "rule": "If the dog needs the bald eagle and the bald eagle chases the dog then the bald eagle needs the dog."}
{"nr": 17121, "rule": "If someone is blue and they like the dog then the dog likes the lion."}
{"nr": 6537, "rule": "If Fiona is blue and Fiona is young then Fiona is kind."}
{"nr": 23773, "rule": "If something is green and blue then it is furry."}
{"nr": 17827, "rule": "If Dave is quiet and Dave is red then Dave is furry."}
{"nr": 19178, "rule": "If something sees the cow and it is rough then it is round."}
{"nr": 6383, "rule": "If someone is cold and red then they need the lion."}
{"nr": 26742, "rule": "If someone is quiet and green then they are blue."}
{"nr": 17602, "rule": "If something chases the dog then it visits the dog."}
{"nr": 19396, "rule": "If someone is young and they visit the dog then they eat the dog."}
{"nr": 22569, "rule": "If something needs the rabbit then it chases the rabbit."}
{"nr": 24985, "rule": "If the bear needs the mouse and the bear eats the mouse then the bear needs the tiger."}
{"nr": 7890, "rule": "If something is cold and it likes the mouse then it likes the tiger."}
{"nr": 25816, "rule": "If something is round and kind then it is red."}
{"nr": 7624, "rule": "If someone is round then they are green."}
{"nr": 22712, "rule": "If someone is green then they are quiet."}
{"nr": 13192, "rule": "If someone chases the mouse then the mouse likes the squirrel."}
{"nr": 6482, "rule": "If someone likes the mouse then they like the bear."}
{"nr": 8492, "rule": "If someone sees the mouse and the mouse is red then they see the lion."}
{"nr": 14379, "rule": "If something likes the cat and the cat likes the tiger then it sees the cat."}
{"nr": 20811, "rule": "If something needs the bear then it needs the dog."}
{"nr": 2541, "rule": "If Bob is kind and Bob is young then Bob is green."}
{"nr": 16417, "rule": "If Harry is cold and Harry is rough then Harry is kind."}
{"nr": 495, "rule": "If the dog is nice then the dog needs the cow."}
{"nr": 22489, "rule": "If something visits the squirrel and it does not need the squirrel then it needs the rabbit."}
{"nr": 6325, "rule": "If something is red then it is nice."}
{"nr": 8835, "rule": "If the bald eagle eats the squirrel and the squirrel is young then the bald eagle likes the cat."}
{"nr": 17611, "rule": "If someone is blue then they are kind."}
{"nr": 26096, "rule": "If something likes the bear and it eats the bear then the bear eats the dog."}
{"nr": 23500, "rule": "If something is round then it is young."}
{"nr": 22943, "rule": "If Fiona is red then Fiona is smart."}
{"nr": 22799, "rule": "If someone is big then they are cold."}
{"nr": 19062, "rule": "If something is green then it is rough."}
{"nr": 20440, "rule": "If someone is quiet then they are kind."}
{"nr": 22657, "rule": "If the lion likes the dog then the lion is green."}
{"nr": 7645, "rule": "If someone likes the cow then they are red."}
{"nr": 3956, "rule": "If Charlie is green then Charlie is blue."}
{"nr": 26298, "rule": "If someone likes the squirrel then they visit the bear."}
{"nr": 1470, "rule": "If Gary is rough and Gary is blue then Gary is furry."}
{"nr": 10025, "rule": "If something is cold then it is red."}
{"nr": 13338, "rule": "If someone is cold and not smart then they are red."}
{"nr": 1557, "rule": "If someone likes the tiger and they visit the tiger then the tiger visits the bear."}
{"nr": 12549, "rule": "If someone is quiet then they are smart."}
{"nr": 10215, "rule": "If something is cold and green then it is round."}
{"nr": 24993, "rule": "If something likes the bald eagle and the bald eagle sees the cow then the bald eagle likes the mouse."}
{"nr": 13187, "rule": "If something likes the squirrel and the squirrel chases the bald eagle then the bald eagle chases the bear."}
{"nr": 7683, "rule": "If the rabbit chases the bald eagle then the rabbit eats the mouse."}
{"nr": 21145, "rule": "If someone is white then they are smart."}
{"nr": 26307, "rule": "If something is big and it likes the dog then the dog is round."}
{"nr": 22954, "rule": "If something is round then it eats the rabbit."}
{"nr": 25546, "rule": "If the tiger is round and the tiger is not blue then the tiger visits the bear."}
{"nr": 5275, "rule": "If someone is round and they need the mouse then the mouse chases the bald eagle."}
{"nr": 5313, "rule": "If someone needs the tiger then they are big."}
{"nr": 12243, "rule": "If something likes the cat then it needs the cat."}
{"nr": 25230, "rule": "If someone is nice and they chase the tiger then they visit the cow."}
{"nr": 16819, "rule": "If something is rough and nice then it is smart."}
{"nr": 25188, "rule": "If the lion visits the squirrel then the lion chases the bear."}
{"nr": 1954, "rule": "If the cow is blue and the cow is round then the cow is green."}
{"nr": 20319, "rule": "If something is round and quiet then it is kind."}
{"nr": 25373, "rule": "If something likes the bald eagle then the bald eagle is red."}
{"nr": 9934, "rule": "If someone visits the bear then the bear is red."}
{"nr": 19496, "rule": "If someone is nice then they are green."}
{"nr": 4794, "rule": "If the cat is kind and the cat eats the bald eagle then the bald eagle visits the cat."}
{"nr": 11269, "rule": "If something is round and rough then it visits the cow."}
{"nr": 13598, "rule": "If Gary is furry then Gary is white."}
{"nr": 1535, "rule": "If something is quiet then it is rough."}
{"nr": 20755, "rule": "If something is cold then it likes the lion."}
{"nr": 11980, "rule": "If something is nice and it visits the bald eagle then the bald eagle needs the cow."}
{"nr": 15929, "rule": "If someone visits the tiger then they are big."}
{"nr": 4145, "rule": "If Harry is round and Harry is green then Harry is cold."}
{"nr": 20201, "rule": "If someone is furry then they are cold."}
{"nr": 5475, "rule": "If something chases the rabbit then the rabbit chases the bear."}
{"nr": 10773, "rule": "If something is green and it sees the squirrel then it sees the dog."}
{"nr": 9502, "rule": "If someone is round then they like the cow."}
{"nr": 27415, "rule": "If something is green then it is smart."}
{"nr": 16022, "rule": "If something sees the bear then the bear is young."}
{"nr": 19673, "rule": "If something chases the lion and it visits the squirrel then the squirrel visits the cat."}
{"nr": 7592, "rule": "If something eats the squirrel and it needs the mouse then it needs the squirrel."}
{"nr": 6437, "rule": "If Dave is blue and Dave is not red then Dave is green."}
{"nr": 9339, "rule": "If Erin is red and Erin is not green then Erin is rough."}
{"nr": 9354, "rule": "If Harry is not furry then Harry is big."}
{"nr": 2827, "rule": "If someone is blue and not cold then they are rough."}
{"nr": 26532, "rule": "If the tiger is kind and the tiger is big then the tiger likes the bear."}
{"nr": 16030, "rule": "If someone is round then they are nice."}
{"nr": 24756, "rule": "If something is big and round then it chases the rabbit."}
{"nr": 12835, "rule": "If someone is smart then they are white."}
{"nr": 25037, "rule": "If something is green then it is smart."}
{"nr": 7689, "rule": "If the squirrel is not green then the squirrel sees the tiger."}
{"nr": 14778, "rule": "If the cow is nice and the cow sees the bald eagle then the cow chases the bald eagle."}
{"nr": 13359, "rule": "If Dave is not red then Dave is round."}
{"nr": 13208, "rule": "If something sees the cow then the cow is round."}
{"nr": 26653, "rule": "If Bob is rough then Bob is white."}
{"nr": 12218, "rule": "If the rabbit visits the cat then the rabbit chases the cat."}
{"nr": 23957, "rule": "If Gary is round and Gary is kind then Gary is young."}
{"nr": 4492, "rule": "If something eats the cat and it eats the mouse then the cat visits the bear."}
{"nr": 6286, "rule": "If something likes the tiger then the tiger visits the mouse."}
{"nr": 18897, "rule": "If something is young and blue then it is smart."}
{"nr": 2823, "rule": "If something sees the tiger and it likes the squirrel then it is green."}
{"nr": 12664, "rule": "If someone is kind then they like the cat."}
{"nr": 5901, "rule": "If someone likes the rabbit then the rabbit likes the cow."}
{"nr": 6148, "rule": "If something is big and nice then it is smart."}
{"nr": 11369, "rule": "If something is quiet and not blue then it is round."}
{"nr": 6732, "rule": "If something likes the cow and the cow needs the bear then the bear likes the cow."}
{"nr": 14710, "rule": "If someone needs the bald eagle and the bald eagle is round then the bald eagle is rough."}
{"nr": 18032, "rule": "If the bald eagle is round then the bald eagle is rough."}
{"nr": 22703, "rule": "If someone is nice and kind then they are round."}
{"nr": 6570, "rule": "If someone is nice and they see the dog then the dog sees the lion."}
{"nr": 26866, "rule": "If something needs the bald eagle then it likes the cow."}
{"nr": 12286, "rule": "If something visits the rabbit and it visits the bear then the bear eats the tiger."}
{"nr": 19004, "rule": "If Erin is young and Erin is not smart then Erin is red."}
{"nr": 17208, "rule": "If Anne is red and Anne is not furry then Anne is young."}
{"nr": 20863, "rule": "If someone is furry then they are blue."}
{"nr": 3614, "rule": "If someone chases the bald eagle and the bald eagle eats the dog then they chase the dog."}
{"nr": 4410, "rule": "If something is round and young then it chases the squirrel."}
{"nr": 18508, "rule": "If someone is red and they see the bear then they see the dog."}
{"nr": 24017, "rule": "If something is red then it visits the rabbit."}
{"nr": 12703, "rule": "If something chases the bald eagle then it is green."}
{"nr": 16923, "rule": "If the tiger visits the cow then the tiger visits the dog."}
{"nr": 21017, "rule": "If something sees the rabbit and the rabbit sees the cow then the rabbit chases the cow."}
{"nr": 22632, "rule": "If something is rough then it likes the bald eagle."}
{"nr": 14967, "rule": "If someone is round then they are quiet."}
{"nr": 27090, "rule": "If something is rough then it is green."}
{"nr": 121, "rule": "If Charlie is rough and Charlie is blue then Charlie is nice."}
{"nr": 4412, "rule": "If the lion is round and the lion is not rough then the lion is red."}
{"nr": 21197, "rule": "If Erin is furry then Erin is smart."}
{"nr": 16387, "rule": "If something is blue then it is furry."}
{"nr": 3030, "rule": "If someone is green then they are big."}
{"nr": 24855, "rule": "If something chases the rabbit then it is big."}
{"nr": 18263, "rule": "If someone is furry and blue then they are white."}
{"nr": 9904, "rule": "If someone is green and young then they are rough."}
{"nr": 19741, "rule": "If someone likes the lion and the lion visits the mouse then the mouse is young."}
{"nr": 9593, "rule": "If someone sees the squirrel then the squirrel sees the dog."}
{"nr": 22927, "rule": "If someone is quiet then they are nice."}
{"nr": 12279, "rule": "If someone is round and not big then they are cold."}
{"nr": 14747, "rule": "If the cow chases the squirrel and the cow is not big then the squirrel visits the cow."}
{"nr": 12937, "rule": "If someone eats the bear then the bear is young."}
{"nr": 15449, "rule": "If Dave is kind then Dave is cold."}
{"nr": 25429, "rule": "If something likes the bear then it is cold."}
{"nr": 26891, "rule": "If someone visits the bear and the bear is nice then they see the dog."}
{"nr": 6061, "rule": "If someone likes the mouse and they are nice then the mouse sees the tiger."}
{"nr": 26329, "rule": "If the rabbit does not chase the tiger then the tiger is cold."}
{"nr": 22515, "rule": "If something visits the squirrel and the squirrel needs the rabbit then it is blue."}
{"nr": 15730, "rule": "If the dog needs the tiger then the dog chases the cat."}
{"nr": 2287, "rule": "If someone is red and not young then they see the lion."}
{"nr": 2174, "rule": "If something is round and cold then it is kind."}
{"nr": 4663, "rule": "If something sees the bear and the bear needs the dog then it visits the dog."}
{"nr": 21255, "rule": "If something needs the cow then it is big."}
{"nr": 805, "rule": "If Bob is smart then Bob is blue."}
{"nr": 5793, "rule": "If someone is kind then they are quiet."}
{"nr": 7234, "rule": "If something is blue and cold then it likes the dog."}
{"nr": 20314, "rule": "If something is kind and blue then it is nice."}
{"nr": 21112, "rule": "If someone eats the mouse then they are young."}
{"nr": 41, "rule": "If someone is green and they eat the rabbit then they are big."}
{"nr": 19647, "rule": "If something is quiet then it is green."}
{"nr": 9149, "rule": "If someone eats the bear and the bear is blue then they are nice."}
{"nr": 6109, "rule": "If something sees the tiger then it needs the tiger."}
{"nr": 13779, "rule": "If someone chases the rabbit and they are not blue then they need the lion."}
{"nr": 7273, "rule": "If someone is round then they see the squirrel."}
{"nr": 12515, "rule": "If something is kind then it is smart."}
{"nr": 4418, "rule": "If the mouse eats the bald eagle then the bald eagle likes the mouse."}
{"nr": 16493, "rule": "If someone eats the mouse and they are round then the mouse chases the bald eagle."}
{"nr": 11400, "rule": "If Fiona is furry and Fiona is big then Fiona is quiet."}
{"nr": 3947, "rule": "If something eats the cow then the cow is cold."}
{"nr": 17055, "rule": "If someone visits the bear then they see the mouse."}
{"nr": 7572, "rule": "If something is young and it does not need the rabbit then it chases the bear."}
{"nr": 2461, "rule": "If Charlie is cold then Charlie is young."}
{"nr": 18186, "rule": "If Dave is furry and Dave is big then Dave is white."}
{"nr": 13936, "rule": "If Harry is kind then Harry is smart."}
{"nr": 10623, "rule": "If the bald eagle sees the cow and the cow chases the bald eagle then the cow needs the rabbit."}
{"nr": 19724, "rule": "If Dave is kind then Dave is white."}
{"nr": 4334, "rule": "If Harry is furry and Harry is blue then Harry is nice."}
{"nr": 4490, "rule": "If someone is rough then they visit the tiger."}
{"nr": 58, "rule": "If something is nice then it eats the bald eagle."}
{"nr": 9683, "rule": "If Harry is round then Harry is smart."}
{"nr": 22122, "rule": "If someone visits the squirrel then the squirrel needs the tiger."}
{"nr": 3725, "rule": "If something is furry and big then it is rough."}
{"nr": 10275, "rule": "If someone visits the cat then the cat likes the bald eagle."}
{"nr": 24177, "rule": "If someone is young and furry then they are white."}
{"nr": 20528, "rule": "If something eats the bald eagle then it sees the bald eagle."}
{"nr": 473, "rule": "If something sees the cat and the cat eats the bald eagle then it eats the dog."}
{"nr": 402, "rule": "If the bald eagle is green then the bald eagle is nice."}
{"nr": 15725, "rule": "If something likes the mouse and it is not big then the mouse likes the lion."}
{"nr": 5619, "rule": "If something visits the rabbit and the rabbit is blue then the rabbit eats the squirrel."}
{"nr": 19366, "rule": "If something is round and not smart then it is blue."}
{"nr": 6121, "rule": "If Fiona is quiet and Fiona is not smart then Fiona is red."}
{"nr": 22161, "rule": "If someone is nice then they are furry."}
{"nr": 3389, "rule": "If someone is quiet and smart then they are furry."}
{"nr": 10409, "rule": "If someone visits the bear then the bear sees the rabbit."}
{"nr": 17576, "rule": "If something visits the rabbit and the rabbit likes the tiger then the tiger likes the rabbit."}
{"nr": 4256, "rule": "If someone needs the cow then they are blue."}
{"nr": 4795, "rule": "If the bald eagle eats the cat and the cat eats the bald eagle then the cat likes the bald eagle."}
{"nr": 4825, "rule": "If someone is furry and not red then they are kind."}
{"nr": 14322, "rule": "If the rabbit eats the cat then the cat is cold."}
{"nr": 16851, "rule": "If something is big then it sees the bald eagle."}
{"nr": 13659, "rule": "If something is green and not white then it is big."}
{"nr": 6355, "rule": "If someone is rough and young then they are nice."}
{"nr": 17562, "rule": "If Erin is red then Erin is big."}
{"nr": 6170, "rule": "If Dave is smart and Dave is red then Dave is kind."}
{"nr": 6600, "rule": "If something sees the cow then the cow needs the tiger."}
{"nr": 3290, "rule": "If someone is furry and not green then they are nice."}
{"nr": 24670, "rule": "If someone is cold and round then they are red."}
{"nr": 26181, "rule": "If something likes the squirrel and the squirrel is nice then it likes the dog."}
{"nr": 431, "rule": "If someone is green and kind then they are round."}
{"nr": 7507, "rule": "If someone is blue and they do not chase the squirrel then they are rough."}
{"nr": 20250, "rule": "If Charlie is cold and Charlie is red then Charlie is big."}
{"nr": 16046, "rule": "If Charlie is green then Charlie is red."}
{"nr": 9666, "rule": "If someone visits the bear and the bear is young then the bear visits the rabbit."}
{"nr": 6943, "rule": "If someone is red then they need the bald eagle."}
{"nr": 18905, "rule": "If Gary is green then Gary is round."}
{"nr": 20373, "rule": "If something needs the lion then it needs the rabbit."}
{"nr": 9875, "rule": "If someone is green and not blue then they are kind."}
{"nr": 4130, "rule": "If something is smart and big then it is cold."}
{"nr": 4711, "rule": "If the lion does not need the cow then the cow is rough."}
{"nr": 6471, "rule": "If something is kind and blue then it is furry."}
{"nr": 5730, "rule": "If something sees the squirrel then it chases the mouse."}
{"nr": 17620, "rule": "If Charlie is quiet then Charlie is smart."}
{"nr": 16059, "rule": "If someone needs the squirrel then the squirrel eats the tiger."}
{"nr": 19732, "rule": "If someone needs the mouse then they are nice."}
{"nr": 6462, "rule": "If something is furry then it is kind."}
{"nr": 11278, "rule": "If something needs the mouse and it chases the bear then the bear chases the cow."}
{"nr": 12649, "rule": "If something needs the cow and it is green then the cow is kind."}
{"nr": 4033, "rule": "If someone is rough then they are furry."}
{"nr": 11294, "rule": "If Gary is smart and Gary is rough then Gary is quiet."}
{"nr": 25724, "rule": "If something is rough then it eats the squirrel."}
{"nr": 12994, "rule": "If Harry is round then Harry is young."}
{"nr": 1283, "rule": "If Charlie is rough and Charlie is big then Charlie is round."}
{"nr": 13772, "rule": "If someone likes the tiger then the tiger is green."}
{"nr": 9287, "rule": "If Charlie is not smart then Charlie is white."}
{"nr": 24108, "rule": "If something is blue then it eats the bald eagle."}
{"nr": 23715, "rule": "If someone eats the cat and they do not chase the squirrel then they chase the tiger."}
{"nr": 8561, "rule": "If someone is green and not white then they are quiet."}
{"nr": 17985, "rule": "If someone visits the squirrel and the squirrel is green then they are green."}
{"nr": 13501, "rule": "If someone visits the lion then the lion visits the rabbit."}
{"nr": 2585, "rule": "If someone is rough then they are white."}
{"nr": 22935, "rule": "If someone chases the mouse then the mouse is cold."}
{"nr": 17704, "rule": "If Erin is red then Erin is young."}
{"nr": 5258, "rule": "If someone chases the tiger then the tiger likes the mouse."}
{"nr": 10977, "rule": "If Harry is quiet then Harry is furry."}
{"nr": 23179, "rule": "If Dave is big and Dave is smart then Dave is cold."}
{"nr": 3402, "rule": "If Bob is rough and Bob is furry then Bob is big."}
{"nr": 24570, "rule": "If something is green then it is nice."}
{"nr": 611, "rule": "If the bald eagle is big then the bald eagle is blue."}
{"nr": 16523, "rule": "If something is young and red then it is white."}
{"nr": 14466, "rule": "If something eats the dog then it eats the bear."}
{"nr": 6111, "rule": "If something needs the bald eagle and the bald eagle likes the tiger then the tiger is green."}
{"nr": 17743, "rule": "If someone chases the tiger and they like the lion then the lion likes the dog."}
{"nr": 26456, "rule": "If the rabbit is nice and the rabbit is cold then the rabbit visits the bear."}
{"nr": 19304, "rule": "If someone is round and blue then they are kind."}
{"nr": 16755, "rule": "If someone is white then they are kind."}
{"nr": 25374, "rule": "If the bear is cold then the bear likes the bald eagle."}
{"nr": 7870, "rule": "If someone likes the lion then they need the lion."}
{"nr": 21830, "rule": "If something sees the mouse and the mouse is big then the mouse likes the rabbit."}
{"nr": 3495, "rule": "If someone needs the cat then the cat needs the cow."}
{"nr": 822, "rule": "If something needs the cow and the cow needs the mouse then it likes the dog."}
{"nr": 27383, "rule": "If Charlie is red then Charlie is young."}
{"nr": 3247, "rule": "If someone sees the rabbit then they see the bald eagle."}
{"nr": 695, "rule": "If the cat is big then the cat is red."}
{"nr": 11954, "rule": "If someone is big and round then they are young."}
{"nr": 9788, "rule": "If someone eats the mouse then the mouse is big."}
{"nr": 1859, "rule": "If someone is round and red then they are kind."}
{"nr": 2879, "rule": "If something chases the lion and the lion chases the dog then the lion needs the dog."}
{"nr": 18276, "rule": "If something visits the rabbit then it is red."}
{"nr": 13084, "rule": "If someone is kind then they are smart."}
{"nr": 23250, "rule": "If something is green then it is big."}
{"nr": 19417, "rule": "If something is blue then it is smart."}
{"nr": 24949, "rule": "If someone eats the cow then they like the bald eagle."}
{"nr": 24994, "rule": "If something is red and it sees the cow then it chases the cow."}
{"nr": 6997, "rule": "If something is rough then it is quiet."}
{"nr": 12671, "rule": "If someone needs the cow then the cow likes the cat."}
{"nr": 3999, "rule": "If something is young and nice then it eats the lion."}
{"nr": 14157, "rule": "If something is big and it chases the squirrel then it visits the squirrel."}
{"nr": 23811, "rule": "If something is quiet and rough then it is red."}
{"nr": 9185, "rule": "If someone chases the bald eagle then they need the mouse."}
{"nr": 7112, "rule": "If someone is cold and white then they are rough."}
{"nr": 24943, "rule": "If someone is red then they see the squirrel."}
{"nr": 14934, "rule": "If something is red then it is cold."}
{"nr": 17935, "rule": "If the lion is big and the lion chases the mouse then the lion eats the bald eagle."}
{"nr": 27316, "rule": "If something is red then it needs the lion."}
{"nr": 3165, "rule": "If Gary is red then Gary is nice."}
{"nr": 14171, "rule": "If something is big then it is red."}
{"nr": 20136, "rule": "If something is blue then it is smart."}
{"nr": 10849, "rule": "If something likes the rabbit then it chases the mouse."}
{"nr": 2745, "rule": "If something is quiet and not blue then it is red."}
{"nr": 11122, "rule": "If Bob is round then Bob is cold."}
{"nr": 4111, "rule": "If the squirrel is round and the squirrel likes the tiger then the tiger likes the lion."}
{"nr": 19984, "rule": "If something is nice and it eats the cat then the cat sees the rabbit."}
{"nr": 5411, "rule": "If the rabbit likes the mouse and the mouse likes the rabbit then the mouse is blue."}
{"nr": 20943, "rule": "If something is rough and furry then it is smart."}
{"nr": 2606, "rule": "If someone is furry then they are cold."}
{"nr": 14135, "rule": "If someone is white and kind then they are cold."}
{"nr": 7997, "rule": "If the bald eagle eats the squirrel and the squirrel is green then the squirrel is round."}
{"nr": 5573, "rule": "If the bear likes the tiger and the bear sees the rabbit then the rabbit sees the bear."}
{"nr": 636, "rule": "If something is blue then it is furry."}
{"nr": 6360, "rule": "If something eats the squirrel and the squirrel is cold then the squirrel eats the dog."}
{"nr": 569, "rule": "If the cat needs the dog then the cat is blue."}
{"nr": 7494, "rule": "If Bob is not red then Bob is furry."}
{"nr": 23001, "rule": "If something is kind and young then it is cold."}
{"nr": 15857, "rule": "If someone needs the mouse then the mouse is green."}
{"nr": 24329, "rule": "If someone needs the squirrel then the squirrel needs the tiger."}
{"nr": 24090, "rule": "If someone is nice and they like the bald eagle then the bald eagle likes the cow."}
{"nr": 11810, "rule": "If Bob is furry and Bob is rough then Bob is young."}
{"nr": 7631, "rule": "If something is furry and red then it is round."}
{"nr": 17056, "rule": "If someone chases the mouse then they visit the mouse."}
{"nr": 5903, "rule": "If someone chases the squirrel then the squirrel is kind."}
{"nr": 12287, "rule": "If something sees the mouse and the mouse chases the squirrel then the mouse likes the bald eagle."}
{"nr": 5508, "rule": "If something is smart and not round then it is white."}
{"nr": 1392, "rule": "If something eats the tiger and it is nice then it needs the mouse."}
{"nr": 15337, "rule": "If someone chases the tiger then they chase the bear."}
{"nr": 19730, "rule": "If someone is kind and blue then they need the mouse."}
{"nr": 12410, "rule": "If Bob is rough and Bob is green then Bob is round."}
{"nr": 24374, "rule": "If something chases the tiger then it is blue."}
{"nr": 3059, "rule": "If something is big and round then it likes the rabbit."}
{"nr": 11987, "rule": "If the bald eagle is green then the bald eagle is rough."}
{"nr": 26827, "rule": "If someone eats the rabbit and they eat the cow then the cow is red."}
{"nr": 3685, "rule": "If the mouse needs the rabbit and the mouse is green then the rabbit likes the mouse."}
{"nr": 22986, "rule": "If Anne is green then Anne is white."}
{"nr": 21033, "rule": "If something visits the dog then the dog visits the mouse."}
{"nr": 23771, "rule": "If Erin is blue then Erin is big."}
{"nr": 16477, "rule": "If the bear does not like the rabbit then the bear is young."}
{"nr": 2625, "rule": "If Gary is round and Gary is cold then Gary is quiet."}
{"nr": 23180, "rule": "If someone is quiet then they are smart."}
{"nr": 26376, "rule": "If Harry is blue then Harry is red."}
{"nr": 7625, "rule": "If someone is green then they are red."}
{"nr": 16855, "rule": "If something eats the tiger and the tiger eats the lion then it visits the lion."}
{"nr": 7204, "rule": "If something sees the bear and it is not big then it visits the cow."}
{"nr": 11624, "rule": "If Erin is white and Erin is round then Erin is furry."}
{"nr": 4810, "rule": "If the squirrel chases the cow then the squirrel visits the lion."}
{"nr": 26698, "rule": "If something needs the tiger then the tiger needs the dog."}
{"nr": 5374, "rule": "If something visits the squirrel then it likes the bear."}
{"nr": 10382, "rule": "If something chases the bald eagle then it needs the bear."}
{"nr": 23662, "rule": "If someone is rough then they visit the mouse."}
{"nr": 126, "rule": "If someone likes the bald eagle then they are green."}
{"nr": 2082, "rule": "If something is nice and young then it is white."}
{"nr": 621, "rule": "If the lion is blue then the lion is green."}
{"nr": 11124, "rule": "If someone is white and not round then they are rough."}
{"nr": 2175, "rule": "If someone eats the bear and they do not eat the rabbit then the rabbit is rough."}
{"nr": 21868, "rule": "If something sees the bear and it chases the dog then the dog eats the bear."}
{"nr": 16685, "rule": "If someone is rough and not kind then they are nice."}
{"nr": 17573, "rule": "If something eats the dog then it is round."}
{"nr": 6888, "rule": "If Charlie is red then Charlie is rough."}
{"nr": 8136, "rule": "If something visits the lion and it is not nice then it eats the bear."}
{"nr": 1676, "rule": "If Bob is not quiet then Bob is kind."}
{"nr": 25689, "rule": "If something eats the mouse then the mouse is nice."}
{"nr": 19223, "rule": "If something is rough and it likes the mouse then it is kind."}
{"nr": 10200, "rule": "If something sees the dog then it eats the mouse."}
{"nr": 14700, "rule": "If someone eats the tiger and the tiger eats the cat then they are rough."}
{"nr": 11303, "rule": "If something is round and not green then it is red."}
{"nr": 19088, "rule": "If the bear is round and the bear visits the dog then the dog visits the bear."}
{"nr": 14616, "rule": "If someone needs the cow then the cow is kind."}
{"nr": 12382, "rule": "If something visits the cow and it is green then the cow needs the dog."}
{"nr": 3716, "rule": "If someone is cold and nice then they are white."}
{"nr": 26599, "rule": "If someone needs the tiger then the tiger sees the squirrel."}
{"nr": 17098, "rule": "If someone is cold and not quiet then they are furry."}
{"nr": 5572, "rule": "If something likes the bear and it does not like the tiger then the tiger likes the bear."}
{"nr": 23303, "rule": "If something is kind then it likes the dog."}
{"nr": 2505, "rule": "If someone is rough and quiet then they are cold."}
{"nr": 8148, "rule": "If someone is green and they see the cow then they like the cow."}
{"nr": 10142, "rule": "If someone is round then they see the lion."}
{"nr": 24023, "rule": "If something needs the dog then it visits the dog."}
{"nr": 2170, "rule": "If someone is cold then they chase the dog."}
{"nr": 18425, "rule": "If something needs the tiger and it is not kind then the tiger needs the cat."}
{"nr": 3311, "rule": "If someone is round and not nice then they are blue."}
{"nr": 21539, "rule": "If something is white then it is cold."}
{"nr": 12883, "rule": "If Dave is furry and Dave is nice then Dave is quiet."}
{"nr": 14188, "rule": "If something is nice then it eats the tiger."}
{"nr": 4116, "rule": "If someone is white then they are furry."}
{"nr": 25699, "rule": "If something is red then it is kind."}
{"nr": 21119, "rule": "If someone is kind then they eat the lion."}
{"nr": 399, "rule": "If the cat is nice then the cat is rough."}
{"nr": 16918, "rule": "If something visits the dog and it sees the rabbit then it chases the cow."}
{"nr": 9087, "rule": "If someone is smart then they are green."}
{"nr": 13307, "rule": "If something is big and quiet then it is green."}
{"nr": 26206, "rule": "If Charlie is green and Charlie is round then Charlie is nice."}
{"nr": 13859, "rule": "If the bear eats the bald eagle and the bald eagle does not see the bear then the bear is blue."}
{"nr": 11033, "rule": "If something needs the rabbit and it visits the bald eagle then the rabbit likes the bald eagle."}
{"nr": 21478, "rule": "If something is rough and big then it is blue."}
{"nr": 16878, "rule": "If Anne is young then Anne is round."}
{"nr": 22870, "rule": "If someone chases the dog then the dog eats the mouse."}
{"nr": 8850, "rule": "If someone needs the cow then they are green."}
{"nr": 11152, "rule": "If the tiger chases the cow then the cow is rough."}
{"nr": 6910, "rule": "If the tiger chases the cow and the cow is rough then the tiger likes the cow."}
{"nr": 321, "rule": "If someone is big and green then they are white."}
{"nr": 18831, "rule": "If something visits the bald eagle then the bald eagle sees the cat."}
{"nr": 1153, "rule": "If something eats the mouse and it sees the mouse then the mouse sees the bear."}
{"nr": 10582, "rule": "If someone needs the rabbit then they visit the mouse."}
{"nr": 25160, "rule": "If the bear is big and the bear chases the squirrel then the squirrel is round."}
{"nr": 15845, "rule": "If someone is kind and blue then they are big."}
{"nr": 73, "rule": "If something is nice and it does not need the bald eagle then the bald eagle needs the mouse."}
{"nr": 17258, "rule": "If someone is blue and they do not eat the lion then the lion likes the tiger."}
{"nr": 14023, "rule": "If something eats the cow then it chases the cat."}
{"nr": 4858, "rule": "If someone likes the lion and the lion sees the squirrel then they are big."}
{"nr": 9268, "rule": "If Fiona is rough and Fiona is not green then Fiona is smart."}
{"nr": 24637, "rule": "If Fiona is green and Fiona is round then Fiona is red."}
{"nr": 10829, "rule": "If someone is cold then they need the rabbit."}
{"nr": 19251, "rule": "If someone is round and green then they are young."}
{"nr": 22809, "rule": "If someone sees the rabbit then they eat the cow."}
{"nr": 2849, "rule": "If someone is big then they visit the tiger."}
{"nr": 6577, "rule": "If someone is quiet then they are nice."}
{"nr": 12775, "rule": "If the lion sees the tiger then the tiger needs the cat."}
{"nr": 4408, "rule": "If someone is nice and not white then they are smart."}
{"nr": 2070, "rule": "If something is young then it is rough."}
{"nr": 10520, "rule": "If someone eats the squirrel then they visit the rabbit."}
{"nr": 24196, "rule": "If something is nice and furry then it is green."}
{"nr": 18965, "rule": "If someone chases the mouse and the mouse eats the bear then the bear eats the rabbit."}
{"nr": 17081, "rule": "If something is round then it needs the tiger."}
{"nr": 4059, "rule": "If something is kind and it visits the dog then the dog is nice."}
{"nr": 27032, "rule": "If someone is red then they need the tiger."}
{"nr": 4504, "rule": "If something is green and not round then it is cold."}
{"nr": 23498, "rule": "If Charlie is quiet then Charlie is nice."}
{"nr": 6190, "rule": "If the cat is kind then the cat is round."}
{"nr": 18097, "rule": "If the tiger needs the bald eagle then the tiger is round."}
{"nr": 3586, "rule": "If something visits the cat then the cat is young."}
{"nr": 26424, "rule": "If Gary is smart and Gary is red then Gary is rough."}
{"nr": 2975, "rule": "If someone is blue and furry then they are kind."}
{"nr": 20006, "rule": "If something sees the cow and it chases the bald eagle then the cow chases the dog."}
{"nr": 6065, "rule": "If someone eats the tiger then they are round."}
{"nr": 10766, "rule": "If something likes the lion then it needs the lion."}
{"nr": 13312, "rule": "If someone is quiet then they are white."}
{"nr": 11893, "rule": "If someone eats the squirrel then the squirrel is kind."}
{"nr": 14395, "rule": "If something is green then it sees the bald eagle."}
{"nr": 18040, "rule": "If someone is furry and green then they are cold."}
{"nr": 14910, "rule": "If someone eats the bald eagle and they eat the bear then the bald eagle chases the bear."}
{"nr": 14534, "rule": "If something is big then it is young."}
{"nr": 20907, "rule": "If something needs the cat then it is young."}
{"nr": 12409, "rule": "If something is furry then it is kind."}
{"nr": 10602, "rule": "If something sees the tiger then the tiger likes the rabbit."}
{"nr": 3576, "rule": "If someone eats the lion and they do not chase the tiger then the lion needs the cow."}
{"nr": 9165, "rule": "If Charlie is green and Charlie is big then Charlie is furry."}
{"nr": 27231, "rule": "If someone needs the tiger then the tiger eats the cat."}
{"nr": 5086, "rule": "If Fiona is big and Fiona is round then Fiona is kind."}
{"nr": 7115, "rule": "If someone is furry and cold then they are blue."}
{"nr": 4936, "rule": "If the tiger does not see the mouse then the mouse is young."}
{"nr": 7516, "rule": "If something sees the squirrel then the squirrel sees the lion."}
{"nr": 21607, "rule": "If the dog is green and the dog does not eat the cat then the cat is cold."}
{"nr": 14350, "rule": "If someone eats the cat then they visit the cat."}
{"nr": 18675, "rule": "If the bear is big and the bear eats the cow then the bear eats the lion."}
{"nr": 5625, "rule": "If Charlie is blue then Charlie is cold."}
{"nr": 24915, "rule": "If Gary is rough then Gary is nice."}
{"nr": 16392, "rule": "If something is big then it eats the lion."}
{"nr": 9385, "rule": "If someone needs the squirrel and they need the bear then they eat the squirrel."}
{"nr": 20861, "rule": "If something eats the dog and it is round then it is big."}
{"nr": 14069, "rule": "If Gary is white and Gary is cold then Gary is young."}
{"nr": 21448, "rule": "If something is young then it is cold."}
{"nr": 12096, "rule": "If someone is white then they are quiet."}
{"nr": 5593, "rule": "If Bob is green then Bob is round."}
{"nr": 4304, "rule": "If something visits the rabbit then it chases the cat."}
{"nr": 7221, "rule": "If someone is furry and not white then they are kind."}
{"nr": 13873, "rule": "If the cat chases the rabbit then the cat chases the squirrel."}
{"nr": 1885, "rule": "If the squirrel is round and the squirrel is not kind then the squirrel is rough."}
{"nr": 9747, "rule": "If the cat sees the mouse and the mouse needs the cat then the mouse sees the cat."}
{"nr": 14994, "rule": "If something eats the dog then the dog sees the tiger."}
{"nr": 6816, "rule": "If the rabbit eats the lion then the rabbit needs the dog."}
{"nr": 11301, "rule": "If Dave is smart then Dave is red."}
{"nr": 16249, "rule": "If someone is nice then they are rough."}
{"nr": 18175, "rule": "If someone eats the lion and they visit the bald eagle then the bald eagle is red."}
{"nr": 23917, "rule": "If something is rough and quiet then it is blue."}
{"nr": 2310, "rule": "If Dave is nice and Dave is blue then Dave is young."}
{"nr": 13641, "rule": "If something chases the bear and it chases the tiger then the bear likes the tiger."}
{"nr": 11857, "rule": "If someone eats the cow and they do not like the rabbit then the rabbit likes the cow."}
{"nr": 7917, "rule": "If Dave is red and Dave is not nice then Dave is rough."}
{"nr": 1478, "rule": "If Bob is round then Bob is young."}
{"nr": 18585, "rule": "If something is round then it chases the cat."}
{"nr": 20875, "rule": "If something is red then it needs the dog."}
{"nr": 25860, "rule": "If Harry is big and Harry is white then Harry is red."}
{"nr": 25560, "rule": "If someone eats the cat then the cat eats the mouse."}
{"nr": 11380, "rule": "If the cow chases the bear then the bear is big."}
{"nr": 4472, "rule": "If someone needs the dog then they are young."}
{"nr": 4770, "rule": "If something is green and red then it sees the mouse."}
{"nr": 6461, "rule": "If Gary is red then Gary is round."}
{"nr": 5666, "rule": "If someone eats the bald eagle and they are not young then the bald eagle chases the rabbit."}
{"nr": 606, "rule": "If someone is furry then they are kind."}
{"nr": 2934, "rule": "If the rabbit is round and the rabbit is red then the rabbit is young."}
{"nr": 10110, "rule": "If something is cold and round then it is quiet."}
{"nr": 8972, "rule": "If something is young and smart then it is blue."}
{"nr": 18407, "rule": "If someone visits the squirrel then the squirrel is red."}
{"nr": 17071, "rule": "If the dog needs the rabbit and the dog sees the rabbit then the dog is kind."}
{"nr": 4020, "rule": "If someone chases the mouse and they are young then they need the cat."}
{"nr": 27104, "rule": "If someone is kind then they need the cat."}
{"nr": 27295, "rule": "If Harry is quiet then Harry is furry."}
{"nr": 11792, "rule": "If something is kind then it is nice."}
{"nr": 3592, "rule": "If someone is red then they are smart."}
{"nr": 1055, "rule": "If something needs the rabbit and it likes the bald eagle then the bald eagle is young."}
{"nr": 3096, "rule": "If Fiona is kind then Fiona is rough."}
{"nr": 8954, "rule": "If someone is round then they like the lion."}
{"nr": 20424, "rule": "If something eats the bald eagle then it sees the rabbit."}
{"nr": 5979, "rule": "If something is young and nice then it is furry."}
{"nr": 4365, "rule": "If someone eats the lion and the lion is nice then they are cold."}
{"nr": 15187, "rule": "If someone is big and red then they are round."}
{"nr": 5707, "rule": "If the rabbit is green then the rabbit likes the cow."}
{"nr": 2016, "rule": "If something is furry and blue then it is nice."}
{"nr": 21311, "rule": "If something sees the squirrel and it does not need the squirrel then it is nice."}
{"nr": 2408, "rule": "If something is young and white then it is nice."}
{"nr": 7675, "rule": "If something sees the rabbit and the rabbit is blue then the rabbit sees the lion."}
{"nr": 19908, "rule": "If someone is quiet and nice then they are big."}
{"nr": 18124, "rule": "If something eats the squirrel then the squirrel needs the mouse."}
{"nr": 1397, "rule": "If the rabbit is red then the rabbit likes the squirrel."}
{"nr": 19590, "rule": "If something likes the cow then it likes the cat."}
{"nr": 7871, "rule": "If someone visits the bald eagle then they like the bald eagle."}
{"nr": 16172, "rule": "If something visits the bald eagle then the bald eagle needs the lion."}
{"nr": 9736, "rule": "If Gary is kind and Gary is not furry then Gary is young."}
{"nr": 8494, "rule": "If someone sees the lion then the lion needs the cat."}
{"nr": 12555, "rule": "If someone eats the bald eagle and they like the bear then the bear needs the rabbit."}
{"nr": 12776, "rule": "If something needs the cat then the cat sees the lion."}
{"nr": 20565, "rule": "If someone chases the dog then they chase the tiger."}
{"nr": 6830, "rule": "If someone needs the tiger and the tiger is big then the tiger eats the lion."}
{"nr": 1645, "rule": "If someone is blue and furry then they are nice."}
{"nr": 11185, "rule": "If someone is rough and they need the cat then the cat chases the bear."}
{"nr": 13481, "rule": "If Erin is blue and Erin is red then Erin is quiet."}
{"nr": 23124, "rule": "If something is kind then it is young."}
{"nr": 18917, "rule": "If the cat is not red then the cat needs the lion."}
{"nr": 25582, "rule": "If Erin is nice then Erin is white."}
{"nr": 2897, "rule": "If someone needs the lion then they like the lion."}
{"nr": 4178, "rule": "If someone is round then they need the bald eagle."}
{"nr": 12771, "rule": "If something is furry and quiet then it is nice."}
{"nr": 17574, "rule": "If the cat is not red then the cat eats the dog."}
{"nr": 24464, "rule": "If someone is green then they see the squirrel."}
{"nr": 11341, "rule": "If the cow needs the bear and the cow is green then the cow sees the bear."}
{"nr": 944, "rule": "If something visits the bald eagle then the bald eagle sees the lion."}
{"nr": 16421, "rule": "If someone is young and not smart then they are cold."}
{"nr": 22260, "rule": "If Bob is big and Bob is not young then Bob is red."}
{"nr": 25294, "rule": "If someone is blue then they visit the squirrel."}
{"nr": 22491, "rule": "If something is kind and it sees the rabbit then it needs the lion."}
{"nr": 15744, "rule": "If someone is kind then they are cold."}
{"nr": 23326, "rule": "If Bob is red and Bob is quiet then Bob is furry."}
{"nr": 17819, "rule": "If someone likes the mouse then they like the tiger."}
{"nr": 12351, "rule": "If something likes the dog and the dog is green then it is round."}
{"nr": 8171, "rule": "If someone visits the squirrel and they are kind then they see the squirrel."}
{"nr": 1244, "rule": "If something is young and not cold then it is rough."}
{"nr": 14578, "rule": "If the lion likes the squirrel and the lion is nice then the lion eats the squirrel."}
{"nr": 9954, "rule": "If someone sees the bald eagle and the bald eagle does not need the bear then they are rough."}
{"nr": 1391, "rule": "If something sees the mouse and it is not nice then the mouse eats the tiger."}
{"nr": 12824, "rule": "If something eats the bear and it is not kind then it is nice."}
{"nr": 2783, "rule": "If something visits the bald eagle and it is nice then the bald eagle sees the squirrel."}
{"nr": 21866, "rule": "If something eats the rabbit then the rabbit is round."}
{"nr": 24621, "rule": "If Dave is cold then Dave is white."}
{"nr": 16347, "rule": "If the bear sees the lion and the cat does not see the bear then the cat sees the bald eagle."}
{"nr": 27193, "rule": "If something sees the dog then the dog needs the tiger."}
{"nr": 10574, "rule": "If someone likes the lion then the lion is red."}
{"nr": 7304, "rule": "If the mouse is cold and the mouse does not visit the squirrel then the mouse needs the rabbit."}
{"nr": 4693, "rule": "If something is young then it visits the bald eagle."}
{"nr": 11281, "rule": "If something is green and quiet then it is white."}
{"nr": 10980, "rule": "If something likes the squirrel then the squirrel likes the dog."}
{"nr": 12170, "rule": "If someone is round and young then they are smart."}
{"nr": 24811, "rule": "If someone is green and they do not need the cow then they chase the lion."}
{"nr": 2652, "rule": "If the squirrel likes the dog and the squirrel sees the dog then the dog likes the squirrel."}
{"nr": 9976, "rule": "If something likes the rabbit then it visits the rabbit."}
{"nr": 26790, "rule": "If someone sees the cow then the cow is round."}
{"nr": 16206, "rule": "If Bob is rough and Bob is not white then Bob is red."}
{"nr": 7911, "rule": "If something sees the bear and it visits the bear then it sees the dog."}
{"nr": 8016, "rule": "If Charlie is young and Charlie is cold then Charlie is blue."}
{"nr": 10756, "rule": "If something is young and nice then it is white."}
{"nr": 14531, "rule": "If Dave is big and Dave is not furry then Dave is white."}
{"nr": 16408, "rule": "If the tiger chases the mouse then the tiger is red."}
{"nr": 1345, "rule": "If Erin is furry and Erin is green then Erin is round."}
{"nr": 16063, "rule": "If someone chases the bear then they are kind."}
{"nr": 26412, "rule": "If something sees the cow then it is nice."}
{"nr": 26195, "rule": "If someone needs the bald eagle then they need the bear."}
{"nr": 6568, "rule": "If the dog is blue then the dog eats the lion."}
{"nr": 26174, "rule": "If something sees the dog and the dog is red then the dog sees the squirrel."}
{"nr": 8545, "rule": "If Erin is kind and Erin is furry then Erin is white."}
{"nr": 22816, "rule": "If someone eats the mouse then the mouse is nice."}
{"nr": 14115, "rule": "If something is cold and not nice then it is round."}
{"nr": 7994, "rule": "If something sees the squirrel then it is cold."}
{"nr": 22746, "rule": "If someone eats the dog then the dog visits the mouse."}
{"nr": 1784, "rule": "If someone is green and young then they are blue."}
{"nr": 4294, "rule": "If something likes the mouse and the mouse needs the lion then the lion likes the cat."}
{"nr": 2662, "rule": "If someone is kind and blue then they are furry."}
{"nr": 10569, "rule": "If the bald eagle likes the lion and the bald eagle is young then the lion likes the bald eagle."}
{"nr": 9943, "rule": "If Gary is round then Gary is big."}
{"nr": 962, "rule": "If someone is round and not young then they are quiet."}
{"nr": 22176, "rule": "If Harry is green and Harry is cold then Harry is round."}
{"nr": 9115, "rule": "If the squirrel is round then the squirrel is blue."}
{"nr": 6057, "rule": "If something is round then it chases the bear."}
{"nr": 15592, "rule": "If someone is quiet then they are young."}
{"nr": 8072, "rule": "If someone eats the cat and the cat is rough then they chase the squirrel."}
{"nr": 2836, "rule": "If someone sees the dog then they like the rabbit."}
{"nr": 1060, "rule": "If Erin is green then Erin is quiet."}
{"nr": 6789, "rule": "If someone is blue and young then they are furry."}
{"nr": 27322, "rule": "If someone chases the tiger and they see the lion then they chase the bear."}
{"nr": 6552, "rule": "If something chases the bear and the bear visits the cat then the cat visits the bear."}
{"nr": 5171, "rule": "If someone sees the cat and they do not see the mouse then the mouse is red."}
{"nr": 24488, "rule": "If the cat needs the cow then the cow is blue."}
{"nr": 16726, "rule": "If something is blue and red then it is nice."}
{"nr": 3470, "rule": "If Fiona is not white then Fiona is furry."}
{"nr": 17133, "rule": "If someone likes the rabbit and the rabbit is round then they like the bald eagle."}
{"nr": 27287, "rule": "If Gary is blue then Gary is furry."}
{"nr": 4735, "rule": "If someone is quiet and not blue then they are young."}
{"nr": 15397, "rule": "If something likes the cat then it is blue."}
{"nr": 14735, "rule": "If someone is rough then they are kind."}
{"nr": 6323, "rule": "If something is round then it is nice."}
{"nr": 7217, "rule": "If someone is nice then they are big."}
{"nr": 20099, "rule": "If something likes the rabbit then the rabbit visits the bald eagle."}
{"nr": 22589, "rule": "If something eats the cat and it eats the cow then the cat visits the cow."}
{"nr": 14496, "rule": "If something eats the cat then it chases the tiger."}
{"nr": 7935, "rule": "If the bear is nice then the bear likes the bald eagle."}
{"nr": 26117, "rule": "If something sees the cat then the cat chases the squirrel."}
{"nr": 16325, "rule": "If someone visits the lion then the lion is rough."}
{"nr": 10144, "rule": "If someone sees the cat then the cat sees the lion."}
{"nr": 7983, "rule": "If something visits the rabbit and the rabbit visits the dog then the dog eats the rabbit."}
{"nr": 17359, "rule": "If someone is round and they do not chase the squirrel then the squirrel visits the bear."}
{"nr": 13456, "rule": "If something eats the dog then it needs the bald eagle."}
{"nr": 8081, "rule": "If Harry is rough then Harry is cold."}
{"nr": 85, "rule": "If something is nice and big then it is furry."}
{"nr": 26659, "rule": "If someone is rough then they are green."}
{"nr": 17980, "rule": "If someone is cold then they eat the bear."}
{"nr": 26403, "rule": "If something is blue then it is nice."}
{"nr": 1545, "rule": "If Gary is nice and Gary is smart then Gary is kind."}
{"nr": 8269, "rule": "If someone is big and round then they are young."}
{"nr": 14547, "rule": "If something is cold and not big then it is furry."}
{"nr": 10043, "rule": "If Anne is smart then Anne is red."}
{"nr": 26303, "rule": "If someone eats the bald eagle and the bald eagle visits the bear then the bald eagle is young."}
{"nr": 4868, "rule": "If someone is blue and furry then they are green."}
{"nr": 22988, "rule": "If someone is red and not round then they are big."}
{"nr": 6509, "rule": "If someone chases the mouse and they like the cow then the cow needs the mouse."}
{"nr": 15172, "rule": "If something likes the rabbit and the rabbit is young then the rabbit is red."}
{"nr": 3712, "rule": "If Anne is quiet then Anne is green."}
{"nr": 10821, "rule": "If the rabbit is not round and the rabbit is not green then the rabbit visits the lion."}
{"nr": 15862, "rule": "If something is red and it visits the rabbit then it sees the rabbit."}
{"nr": 14599, "rule": "If the lion is round then the lion sees the tiger."}
{"nr": 7672, "rule": "If someone needs the dog then they are young."}
{"nr": 4219, "rule": "If something is cold and it eats the dog then the dog eats the mouse."}
{"nr": 15365, "rule": "If someone is white and round then they are green."}
{"nr": 20596, "rule": "If Charlie is kind and Charlie is quiet then Charlie is red."}
{"nr": 573, "rule": "If someone is big and not red then they are young."}
{"nr": 12110, "rule": "If someone is round then they are nice."}
{"nr": 9494, "rule": "If someone eats the cow and the cow likes the bear then they need the squirrel."}
{"nr": 11354, "rule": "If someone needs the tiger and the tiger needs the mouse then they are blue."}
{"nr": 3262, "rule": "If someone is nice and blue then they are red."}
{"nr": 16011, "rule": "If the bald eagle visits the dog and the dog needs the bald eagle then the bald eagle needs the dog."}
{"nr": 11690, "rule": "If something sees the bear then the bear needs the lion."}
{"nr": 5047, "rule": "If someone needs the cow then they are round."}
{"nr": 66, "rule": "If the bear is rough then the bear is blue."}
{"nr": 2276, "rule": "If someone sees the mouse then the mouse eats the dog."}
{"nr": 17706, "rule": "If someone eats the cat then they are young."}
{"nr": 20165, "rule": "If the cow chases the cat and the cat needs the cow then the cat needs the dog."}
{"nr": 19240, "rule": "If Charlie is white then Charlie is green."}
{"nr": 18996, "rule": "If something needs the lion and the lion does not eat the rabbit then it is young."}
{"nr": 22853, "rule": "If Charlie is quiet then Charlie is cold."}
{"nr": 17374, "rule": "If someone is smart and not round then they are kind."}
{"nr": 16048, "rule": "If someone likes the bald eagle and they like the cat then they see the lion."}
{"nr": 25361, "rule": "If someone needs the dog and the dog is not rough then they visit the squirrel."}
{"nr": 17214, "rule": "If someone is big and they like the dog then they chase the tiger."}
{"nr": 4751, "rule": "If someone is white and kind then they are cold."}
{"nr": 22252, "rule": "If someone eats the rabbit then they like the rabbit."}
{"nr": 26896, "rule": "If someone visits the lion then they visit the mouse."}
{"nr": 10250, "rule": "If someone likes the bear then they eat the cat."}
{"nr": 7436, "rule": "If someone is nice and kind then they are quiet."}
{"nr": 20824, "rule": "If something visits the cow then the cow sees the cat."}
{"nr": 3521, "rule": "If something eats the squirrel then the squirrel is nice."}
{"nr": 1587, "rule": "If Dave is rough and Dave is blue then Dave is young."}
{"nr": 13473, "rule": "If something needs the bear then the bear needs the dog."}
{"nr": 967, "rule": "If Fiona is smart and Fiona is quiet then Fiona is round."}
{"nr": 14564, "rule": "If something sees the dog then the dog sees the squirrel."}
{"nr": 11897, "rule": "If the rabbit is round then the rabbit chases the mouse."}
{"nr": 4895, "rule": "If something eats the cow and the cow is not nice then the cow chases the lion."}
{"nr": 3542, "rule": "If Charlie is furry and Charlie is white then Charlie is red."}
{"nr": 15641, "rule": "If someone is big then they are rough."}
{"nr": 7759, "rule": "If something visits the cat then it visits the squirrel."}
{"nr": 17218, "rule": "If someone likes the dog then the dog needs the tiger."}
{"nr": 7362, "rule": "If Dave is kind then Dave is quiet."}
{"nr": 25416, "rule": "If Fiona is nice then Fiona is blue."}
{"nr": 15461, "rule": "If someone is smart and big then they are red."}
{"nr": 22394, "rule": "If the rabbit eats the bald eagle then the rabbit is kind."}
{"nr": 1474, "rule": "If Anne is young and Anne is big then Anne is furry."}
{"nr": 19813, "rule": "If the rabbit needs the cat and the rabbit is not kind then the rabbit is young."}
{"nr": 7554, "rule": "If the bear visits the squirrel and the bear likes the bald eagle then the bald eagle visits the bear."}
{"nr": 19971, "rule": "If the dog is round then the dog needs the lion."}
{"nr": 7193, "rule": "If the dog is blue then the dog is round."}
{"nr": 2537, "rule": "If Bob is green and Bob is not red then Bob is nice."}
{"nr": 4744, "rule": "If someone is kind then they eat the squirrel."}
{"nr": 15170, "rule": "If the rabbit sees the mouse then the rabbit is round."}
{"nr": 9290, "rule": "If something eats the tiger and the tiger eats the mouse then the mouse needs the tiger."}
{"nr": 8622, "rule": "If something sees the tiger then the tiger is nice."}
{"nr": 18806, "rule": "If someone chases the dog and the dog eats the bald eagle then the bald eagle eats the dog."}
{"nr": 25761, "rule": "If someone is green then they are furry."}
{"nr": 25091, "rule": "If Dave is smart and Dave is nice then Dave is big."}
{"nr": 12114, "rule": "If someone is cold and not big then they are green."}
{"nr": 12850, "rule": "If someone is nice and red then they chase the tiger."}
{"nr": 13586, "rule": "If something needs the lion and it is red then the lion is cold."}
{"nr": 10804, "rule": "If Anne is big then Anne is nice."}
{"nr": 4517, "rule": "If someone is big then they are kind."}
{"nr": 2357, "rule": "If Fiona is blue then Fiona is white."}
{"nr": 18038, "rule": "If something sees the bald eagle then it likes the dog."}
{"nr": 26607, "rule": "If someone is kind then they are quiet."}
{"nr": 25544, "rule": "If something likes the tiger then the tiger is green."}
{"nr": 22768, "rule": "If the bald eagle visits the dog and the bald eagle eats the dog then the dog is green."}
{"nr": 7035, "rule": "If Charlie is cold and Charlie is young then Charlie is kind."}
{"nr": 2583, "rule": "If someone is white and not quiet then they are rough."}
{"nr": 16511, "rule": "If someone is young and they see the dog then the dog likes the bald eagle."}
{"nr": 189, "rule": "If Bob is blue then Bob is green."}
{"nr": 19629, "rule": "If something is green then it is round."}
{"nr": 4175, "rule": "If something sees the rabbit then the rabbit chases the cow."}
{"nr": 13457, "rule": "If something needs the cat and the cat needs the dog then it is kind."}
{"nr": 22297, "rule": "If the lion sees the squirrel and the lion is blue then the lion chases the mouse."}
{"nr": 9034, "rule": "If someone is young and not blue then they are kind."}
{"nr": 4565, "rule": "If the tiger is not round then the tiger likes the rabbit."}
{"nr": 1232, "rule": "If something is nice then it needs the mouse."}
{"nr": 7793, "rule": "If something likes the bear then it is big."}
{"nr": 13319, "rule": "If Harry is cold then Harry is blue."}
{"nr": 3916, "rule": "If something is green and not rough then it is kind."}
{"nr": 21954, "rule": "If someone is kind and nice then they are big."}
{"nr": 5380, "rule": "If someone eats the cat and they see the cat then the cat sees the tiger."}
{"nr": 14075, "rule": "If someone is young then they eat the cow."}
{"nr": 18242, "rule": "If someone eats the dog and they see the cat then the dog eats the cat."}
{"nr": 21827, "rule": "If something needs the dog then it sees the lion."}
{"nr": 22677, "rule": "If something is cold and rough then it is furry."}
{"nr": 4331, "rule": "If something chases the cow then the cow needs the lion."}
{"nr": 25275, "rule": "If Bob is quiet and Bob is green then Bob is young."}
{"nr": 17776, "rule": "If something is white and quiet then it is blue."}
{"nr": 8389, "rule": "If something is rough and not round then it is young."}
{"nr": 17022, "rule": "If someone is nice then they like the cow."}
{"nr": 17500, "rule": "If something is red then it is blue."}
{"nr": 16945, "rule": "If something is smart then it is blue."}
{"nr": 8468, "rule": "If someone likes the mouse then they eat the dog."}
{"nr": 2109, "rule": "If the mouse chases the tiger then the tiger chases the mouse."}
{"nr": 12001, "rule": "If Charlie is not green then Charlie is rough."}
{"nr": 20231, "rule": "If someone is green then they see the cow."}
{"nr": 21538, "rule": "If something is green then it is red."}
{"nr": 12005, "rule": "If something is nice and red then it is young."}
{"nr": 10277, "rule": "If someone chases the bald eagle then they visit the cat."}
{"nr": 12281, "rule": "If something visits the rabbit then the rabbit visits the tiger."}
{"nr": 26232, "rule": "If something eats the dog and the dog eats the mouse then the dog sees the tiger."}
{"nr": 2933, "rule": "If the rabbit is not round then the rabbit is red."}
{"nr": 6935, "rule": "If someone chases the cow then they chase the cat."}
{"nr": 4551, "rule": "If something is nice and not rough then it is furry."}
{"nr": 15732, "rule": "If something chases the cow then it eats the cat."}
{"nr": 25157, "rule": "If someone eats the bald eagle then they eat the squirrel."}
{"nr": 18995, "rule": "If the rabbit is young then the rabbit is rough."}
{"nr": 10340, "rule": "If someone is round and they do not eat the rabbit then they are cold."}
{"nr": 25731, "rule": "If something sees the dog then it eats the bald eagle."}
{"nr": 17752, "rule": "If something visits the cat and it is not cold then it is green."}
{"nr": 24309, "rule": "If someone eats the cow and they are big then the cow likes the bald eagle."}
{"nr": 19194, "rule": "If Dave is round and Dave is smart then Dave is white."}
{"nr": 24896, "rule": "If the cow visits the mouse then the mouse is cold."}
{"nr": 22017, "rule": "If Fiona is red then Fiona is round."}
{"nr": 10704, "rule": "If someone is young then they need the bear."}
{"nr": 22082, "rule": "If someone is round then they like the bear."}
{"nr": 3772, "rule": "If someone is blue and rough then they eat the rabbit."}
{"nr": 18117, "rule": "If the cat is not rough then the cat likes the lion."}
{"nr": 1650, "rule": "If someone sees the squirrel then the squirrel sees the cat."}
{"nr": 23310, "rule": "If someone is cold then they are young."}
{"nr": 26587, "rule": "If something is nice then it is cold."}
{"nr": 24076, "rule": "If something is young then it is round."}
{"nr": 26597, "rule": "If the bear chases the mouse and the bear is rough then the mouse is young."}
{"nr": 6776, "rule": "If something is young then it sees the tiger."}
{"nr": 5607, "rule": "If something visits the squirrel then the squirrel is big."}
{"nr": 20717, "rule": "If something is kind and furry then it is white."}
{"nr": 7873, "rule": "If someone is young and they need the bald eagle then the bald eagle visits the lion."}
{"nr": 7638, "rule": "If someone is white then they are green."}
{"nr": 9595, "rule": "If someone sees the dog and they are not red then they chase the cat."}
{"nr": 8736, "rule": "If something eats the bald eagle and the bald eagle eats the cow then the bald eagle chases the cow."}
{"nr": 5872, "rule": "If something needs the bald eagle then the bald eagle chases the mouse."}
{"nr": 2014, "rule": "If something is white and kind then it is quiet."}
{"nr": 19409, "rule": "If something is quiet then it is white."}
{"nr": 3744, "rule": "If Erin is young then Erin is red."}
{"nr": 20028, "rule": "If something is rough then it is red."}
{"nr": 9133, "rule": "If something is round and white then it is rough."}
{"nr": 6797, "rule": "If something visits the tiger and it sees the tiger then the tiger visits the bald eagle."}
{"nr": 11742, "rule": "If something visits the cat then it likes the cat."}
{"nr": 14610, "rule": "If something is furry and white then it is rough."}
{"nr": 3219, "rule": "If someone is white and cold then they are furry."}
{"nr": 4146, "rule": "If something chases the rabbit then the rabbit chases the cat."}
{"nr": 17806, "rule": "If Harry is blue then Harry is red."}
{"nr": 25889, "rule": "If someone is green and they see the bear then the bear is young."}
{"nr": 18238, "rule": "If the cow visits the cat and the cow sees the cat then the cat is round."}
{"nr": 25637, "rule": "If something sees the tiger then the tiger eats the dog."}
{"nr": 14906, "rule": "If something is quiet and not kind then it is nice."}
{"nr": 12615, "rule": "If something likes the rabbit then it is nice."}
{"nr": 24194, "rule": "If something is nice then it is furry."}
{"nr": 21183, "rule": "If something needs the bear and the bear chases the cow then the cow is nice."}
{"nr": 625, "rule": "If someone eats the cat then the cat visits the rabbit."}
{"nr": 19236, "rule": "If someone is young and white then they are big."}
{"nr": 5249, "rule": "If something is white and not red then it is cold."}
{"nr": 19011, "rule": "If something chases the cow then the cow chases the mouse."}
{"nr": 6872, "rule": "If the lion needs the rabbit then the rabbit visits the lion."}
{"nr": 6812, "rule": "If something is rough and it visits the squirrel then the squirrel visits the rabbit."}
{"nr": 26355, "rule": "If something needs the bear then it needs the mouse."}
{"nr": 27118, "rule": "If the bear sees the dog and the dog eats the tiger then the dog eats the bear."}
{"nr": 4935, "rule": "If something is nice and it needs the tiger then the tiger is kind."}
{"nr": 26159, "rule": "If someone is green then they are round."}
{"nr": 4733, "rule": "If Harry is rough and Harry is red then Harry is quiet."}
{"nr": 13062, "rule": "If the bald eagle is young then the bald eagle chases the cat."}
{"nr": 15734, "rule": "If someone visits the squirrel then they visit the mouse."}
{"nr": 18872, "rule": "If someone is round and furry then they are green."}
{"nr": 12053, "rule": "If something is nice and red then it is big."}
{"nr": 17575, "rule": "If something is round and not green then it likes the dog."}
{"nr": 22524, "rule": "If the bear eats the cow then the cow visits the bear."}
{"nr": 26619, "rule": "If someone is green and they chase the cow then they need the cow."}
{"nr": 21930, "rule": "If something is young and big then it is quiet."}
{"nr": 7847, "rule": "If someone is cold and round then they are nice."}
{"nr": 12579, "rule": "If something visits the rabbit and the rabbit does not need the lion then the lion is green."}
{"nr": 18512, "rule": "If someone is round and they chase the cat then they are blue."}
{"nr": 6636, "rule": "If something visits the rabbit then the rabbit chases the tiger."}
{"nr": 18451, "rule": "If Harry is round then Harry is white."}
{"nr": 1822, "rule": "If Dave is blue then Dave is green."}
{"nr": 18160, "rule": "If Bob is cold then Bob is blue."}
{"nr": 15184, "rule": "If something is big and not young then it is blue."}
{"nr": 10806, "rule": "If someone is smart and nice then they are furry."}
{"nr": 2330, "rule": "If something is white and smart then it is green."}
{"nr": 22036, "rule": "If someone needs the cat and the cat needs the squirrel then the squirrel is young."}
{"nr": 17080, "rule": "If something likes the bear and it is cold then the bear chases the tiger."}
{"nr": 978, "rule": "If Anne is furry and Anne is nice then Anne is kind."}
{"nr": 15455, "rule": "If someone is quiet then they are smart."}
{"nr": 13821, "rule": "If something is big then it is red."}
{"nr": 14203, "rule": "If Anne is not big then Anne is young."}
{"nr": 12798, "rule": "If someone eats the mouse then the mouse is cold."}
{"nr": 22796, "rule": "If someone eats the bald eagle then the bald eagle visits the lion."}
{"nr": 4613, "rule": "If the rabbit is blue and the rabbit sees the bear then the bear visits the cow."}
{"nr": 10361, "rule": "If someone is green and nice then they are rough."}
{"nr": 6231, "rule": "If someone sees the mouse then the mouse likes the cow."}
{"nr": 20411, "rule": "If someone is nice then they are green."}
{"nr": 14658, "rule": "If something chases the cow and the cow sees the tiger then it sees the cow."}
{"nr": 12313, "rule": "If something is white and big then it is round."}
{"nr": 19112, "rule": "If Charlie is rough and Charlie is not nice then Charlie is quiet."}
{"nr": 4254, "rule": "If something sees the dog and it is green then the dog likes the tiger."}
{"nr": 8533, "rule": "If something is kind and not red then it is nice."}
{"nr": 20348, "rule": "If Bob is red and Bob is cold then Bob is young."}
{"nr": 9574, "rule": "If Gary is blue then Gary is rough."}
{"nr": 18699, "rule": "If the rabbit is rough and the rabbit is young then the rabbit visits the bear."}
{"nr": 22484, "rule": "If the squirrel likes the cow then the squirrel likes the rabbit."}
{"nr": 24058, "rule": "If something is nice then it is red."}
{"nr": 17149, "rule": "If someone visits the cow then the cow sees the tiger."}
{"nr": 2663, "rule": "If something eats the cow then the cow visits the rabbit."}
{"nr": 3140, "rule": "If someone is smart and green then they are round."}
{"nr": 14214, "rule": "If Bob is furry then Bob is round."}
{"nr": 23559, "rule": "If someone is round then they are smart."}
{"nr": 18534, "rule": "If Charlie is not nice then Charlie is big."}
{"nr": 6288, "rule": "If something visits the tiger then the tiger is red."}
{"nr": 24389, "rule": "If something sees the squirrel then it sees the bear."}
{"nr": 26468, "rule": "If Dave is white then Dave is green."}
{"nr": 1375, "rule": "If someone is white and not furry then they are red."}
{"nr": 7912, "rule": "If something eats the lion then the lion sees the dog."}
{"nr": 8737, "rule": "If something likes the cow and it is blue then it chases the bald eagle."}
{"nr": 9089, "rule": "If something chases the mouse then the mouse chases the bear."}
{"nr": 11353, "rule": "If something visits the bald eagle then it visits the rabbit."}
{"nr": 1575, "rule": "If something needs the bald eagle and it does not see the mouse then the mouse needs the bald eagle."}
{"nr": 21109, "rule": "If the mouse chases the cat then the cat is nice."}
{"nr": 2402, "rule": "If something visits the lion and it sees the lion then the lion sees the cat."}
{"nr": 16491, "rule": "If someone is big and they like the bald eagle then the bald eagle eats the dog."}
{"nr": 9011, "rule": "If something likes the cow then the cow is young."}
{"nr": 12508, "rule": "If someone is big and green then they are young."}
{"nr": 16885, "rule": "If someone is blue then they are round."}
{"nr": 21496, "rule": "If someone sees the dog then the dog is red."}
{"nr": 23487, "rule": "If something is round then it likes the cat."}
{"nr": 18225, "rule": "If the tiger is blue then the tiger needs the bear."}
{"nr": 5770, "rule": "If something is rough and cold then it is round."}
{"nr": 1450, "rule": "If someone is smart then they are white."}
{"nr": 11012, "rule": "If something eats the rabbit then the rabbit sees the cow."}
{"nr": 22660, "rule": "If something chases the cow then the cow eats the bear."}
{"nr": 20568, "rule": "If Gary is rough and Gary is not green then Gary is quiet."}
{"nr": 8076, "rule": "If the tiger visits the cat then the tiger eats the bald eagle."}
{"nr": 22004, "rule": "If someone is kind then they are quiet."}
{"nr": 27334, "rule": "If something is smart then it is blue."}
{"nr": 25610, "rule": "If someone is blue then they are white."}
{"nr": 15984, "rule": "If the bear likes the lion and the lion likes the bear then the lion visits the tiger."}
{"nr": 15753, "rule": "If Fiona is white then Fiona is rough."}
{"nr": 7478, "rule": "If someone is furry then they are rough."}
{"nr": 11782, "rule": "If the dog visits the bald eagle and the bald eagle does not see the squirrel then the dog sees the squirrel."}
{"nr": 4303, "rule": "If something chases the rabbit and the rabbit eats the cat then it eats the cat."}
{"nr": 13002, "rule": "If someone is green and nice then they are rough."}
{"nr": 1307, "rule": "If someone needs the cow and they are cold then they need the lion."}
{"nr": 17734, "rule": "If someone needs the cat then the cat needs the squirrel."}
{"nr": 7451, "rule": "If something visits the rabbit then it likes the cat."}
{"nr": 26627, "rule": "If something visits the cow then the cow needs the bear."}
{"nr": 9718, "rule": "If something visits the cow then the cow is red."}
{"nr": 10064, "rule": "If something eats the mouse then the mouse visits the tiger."}
{"nr": 10233, "rule": "If something is cold and it does not visit the rabbit then the rabbit chases the mouse."}
{"nr": 9343, "rule": "If the mouse visits the rabbit and the rabbit does not chase the mouse then the rabbit is big."}
{"nr": 12298, "rule": "If someone chases the tiger and the tiger is green then the tiger is young."}
{"nr": 18813, "rule": "If the cow likes the tiger and the tiger likes the cow then the tiger sees the cow."}
{"nr": 23900, "rule": "If someone is kind then they are quiet."}
{"nr": 456, "rule": "If Gary is furry then Gary is white."}
{"nr": 21982, "rule": "If something is nice then it is quiet."}
{"nr": 6129, "rule": "If someone is kind then they are young."}
{"nr": 7889, "rule": "If something likes the bear then the bear is cold."}
{"nr": 10167, "rule": "If something eats the lion and the lion is young then the lion eats the dog."}
{"nr": 11506, "rule": "If someone likes the mouse and they are green then they eat the cat."}
{"nr": 13935, "rule": "If Charlie is kind then Charlie is big."}
{"nr": 12578, "rule": "If something chases the squirrel and the squirrel likes the bear then the squirrel visits the bear."}
{"nr": 19432, "rule": "If something chases the mouse then it is kind."}
{"nr": 17266, "rule": "If Erin is kind and Erin is rough then Erin is cold."}
{"nr": 15933, "rule": "If someone likes the bear then the bear needs the cow."}
{"nr": 11491, "rule": "If something visits the tiger then the tiger likes the cat."}
{"nr": 9922, "rule": "If something is furry then it is rough."}
{"nr": 21638, "rule": "If Fiona is kind then Fiona is nice."}
{"nr": 13788, "rule": "If something is cold then it chases the rabbit."}
{"nr": 24231, "rule": "If something visits the bald eagle then it is green."}
{"nr": 18231, "rule": "If someone sees the bear then they see the mouse."}
{"nr": 27218, "rule": "If someone is quiet then they are young."}
{"nr": 4791, "rule": "If someone is cold then they visit the squirrel."}
{"nr": 374, "rule": "If something is cold and round then it is nice."}
{"nr": 23824, "rule": "If Anne is quiet then Anne is white."}
{"nr": 17159, "rule": "If someone chases the dog and they are young then they need the bear."}
{"nr": 26092, "rule": "If something likes the tiger then it is rough."}
{"nr": 12896, "rule": "If someone chases the cat and they are not cold then they visit the cat."}
{"nr": 13627, "rule": "If someone is quiet then they are cold."}
{"nr": 5049, "rule": "If someone chases the bear then the bear needs the cow."}
{"nr": 22352, "rule": "If something visits the squirrel then it likes the mouse."}
{"nr": 3058, "rule": "If the bear needs the rabbit then the bear needs the lion."}
{"nr": 15388, "rule": "If something is round and it likes the tiger then it needs the cat."}
{"nr": 12624, "rule": "If something is red then it eats the dog."}
{"nr": 14848, "rule": "If someone chases the rabbit and the rabbit is blue then they eat the rabbit."}
{"nr": 12646, "rule": "If something is red then it is white."}
{"nr": 11898, "rule": "If something needs the mouse then it is rough."}
{"nr": 13639, "rule": "If something sees the bear and the bear eats the lion then it sees the bald eagle."}
{"nr": 8550, "rule": "If Anne is white and Anne is kind then Anne is furry."}
{"nr": 6881, "rule": "If someone visits the tiger then they need the tiger."}
{"nr": 24092, "rule": "If someone chases the squirrel then they chase the tiger."}
{"nr": 10938, "rule": "If Gary is big and Gary is not blue then Gary is kind."}
{"nr": 2689, "rule": "If someone needs the bear then the bear sees the dog."}
{"nr": 18569, "rule": "If something likes the lion and it needs the bear then the lion is green."}
{"nr": 14602, "rule": "If someone sees the tiger and the tiger likes the squirrel then the squirrel is rough."}
{"nr": 1223, "rule": "If Harry is rough then Harry is furry."}
{"nr": 23036, "rule": "If someone is round then they are green."}
{"nr": 13503, "rule": "If someone is kind then they like the lion."}
{"nr": 11819, "rule": "If something is smart then it is quiet."}
{"nr": 19190, "rule": "If something is white then it is smart."}
{"nr": 18591, "rule": "If the bear is green and the bear needs the bald eagle then the bald eagle is green."}
{"nr": 17814, "rule": "If someone chases the tiger and they are not green then they chase the mouse."}
{"nr": 1675, "rule": "If something is kind and not nice then it is green."}
{"nr": 27141, "rule": "If someone needs the rabbit then the rabbit needs the squirrel."}
{"nr": 8620, "rule": "If something eats the rabbit then the rabbit needs the bald eagle."}
{"nr": 15709, "rule": "If someone sees the rabbit and the rabbit visits the mouse then they visit the bald eagle."}
{"nr": 10113, "rule": "If something is big and round then it is cold."}
{"nr": 24862, "rule": "If the mouse is red and the mouse does not see the cat then the cat is nice."}
{"nr": 22056, "rule": "If the bear likes the dog then the dog visits the bear."}
{"nr": 16399, "rule": "If something chases the lion then the lion eats the rabbit."}
{"nr": 23580, "rule": "If someone likes the bald eagle then they visit the squirrel."}
{"nr": 13703, "rule": "If the bear does not like the mouse then the mouse likes the lion."}
{"nr": 7755, "rule": "If something eats the dog then it chases the squirrel."}
{"nr": 25959, "rule": "If someone is rough and they chase the bald eagle then the bald eagle visits the cow."}
{"nr": 8226, "rule": "If someone eats the bald eagle and they do not chase the squirrel then they like the cow."}
{"nr": 13412, "rule": "If something chases the bald eagle then it is cold."}
{"nr": 21821, "rule": "If Gary is quiet then Gary is kind."}
{"nr": 5944, "rule": "If someone chases the squirrel then they are rough."}
{"nr": 25997, "rule": "If something is nice and it chases the lion then it sees the lion."}
{"nr": 15360, "rule": "If something is kind then it is big."}
{"nr": 4255, "rule": "If the mouse eats the rabbit then the rabbit needs the cow."}
{"nr": 10107, "rule": "If Bob is young then Bob is nice."}
{"nr": 16225, "rule": "If something is kind and not big then it is nice."}
{"nr": 10153, "rule": "If Dave is big and Dave is blue then Dave is cold."}
{"nr": 14008, "rule": "If something is young and it chases the bear then the bear is cold."}
{"nr": 19285, "rule": "If something likes the dog and it is not round then it likes the bear."}
{"nr": 15177, "rule": "If someone is round then they eat the lion."}
{"nr": 17046, "rule": "If something is furry and nice then it is rough."}
{"nr": 11875, "rule": "If Dave is green and Dave is red then Dave is rough."}
{"nr": 27267, "rule": "If someone is round and they need the lion then the lion is red."}
{"nr": 13431, "rule": "If someone is smart then they are big."}
{"nr": 21467, "rule": "If Anne is green and Anne is blue then Anne is round."}
{"nr": 5495, "rule": "If something is young and blue then it is smart."}
{"nr": 21810, "rule": "If someone chases the tiger then the tiger likes the rabbit."}
{"nr": 2544, "rule": "If something is blue and young then it is big."}
{"nr": 27162, "rule": "If someone is quiet and smart then they are red."}
{"nr": 27013, "rule": "If something is green then it is cold."}
{"nr": 3413, "rule": "If the cat is blue then the cat is rough."}
{"nr": 21894, "rule": "If Harry is blue then Harry is big."}
{"nr": 8811, "rule": "If Bob is rough then Bob is cold."}
{"nr": 5587, "rule": "If someone needs the tiger then they are cold."}
{"nr": 17512, "rule": "If someone is big then they are red."}
{"nr": 24640, "rule": "If something is round and kind then it is green."}
{"nr": 18966, "rule": "If someone chases the bear and they do not eat the lion then the bear chases the mouse."}
{"nr": 2561, "rule": "If the squirrel is round then the squirrel is rough."}
{"nr": 6923, "rule": "If someone sees the squirrel then they see the lion."}
{"nr": 6365, "rule": "If something is kind and it does not like the dog then it likes the lion."}
{"nr": 9068, "rule": "If someone is red then they are smart."}
{"nr": 15687, "rule": "If someone is round then they chase the bald eagle."}
{"nr": 18803, "rule": "If someone is quiet and not cold then they are round."}
{"nr": 26500, "rule": "If something likes the lion then the lion is young."}
{"nr": 6615, "rule": "If someone sees the rabbit and they are big then they are cold."}
{"nr": 14463, "rule": "If something eats the bear then it is green."}
{"nr": 8192, "rule": "If someone sees the cat and they do not need the bear then the cat sees the rabbit."}
{"nr": 3851, "rule": "If someone chases the tiger then they are big."}
{"nr": 22614, "rule": "If Bob is white and Bob is quiet then Bob is red."}
{"nr": 15235, "rule": "If something is white and not quiet then it is furry."}
{"nr": 8050, "rule": "If someone chases the lion and the lion is round then they visit the cat."}
{"nr": 2751, "rule": "If something is white then it is quiet."}
{"nr": 242, "rule": "If the lion chases the cat then the cat sees the lion."}
{"nr": 20865, "rule": "If someone is smart then they are quiet."}
{"nr": 12482, "rule": "If someone is cold then they are furry."}
{"nr": 9474, "rule": "If something is smart and kind then it is cold."}
{"nr": 7696, "rule": "If something is rough then it is round."}
{"nr": 26813, "rule": "If someone is nice and they chase the cow then they visit the tiger."}
{"nr": 7249, "rule": "If something likes the mouse and it is rough then the mouse is rough."}
{"nr": 22710, "rule": "If someone is furry then they are green."}
{"nr": 4190, "rule": "If something is furry then it is rough."}
{"nr": 6008, "rule": "If something is young and kind then it eats the rabbit."}
{"nr": 19934, "rule": "If something is red and smart then it is kind."}
{"nr": 19716, "rule": "If someone is nice then they visit the mouse."}
{"nr": 22141, "rule": "If Erin is smart then Erin is quiet."}
{"nr": 17584, "rule": "If the lion is nice then the lion chases the mouse."}
{"nr": 240, "rule": "If the cat chases the lion and the lion is blue then the lion sees the cat."}
{"nr": 1776, "rule": "If Dave is smart then Dave is furry."}
{"nr": 24814, "rule": "If someone chases the lion then they chase the bear."}
{"nr": 9024, "rule": "If something is cold and round then it is kind."}
{"nr": 17112, "rule": "If Bob is quiet then Bob is young."}
{"nr": 14714, "rule": "If someone sees the dog then they are round."}
{"nr": 24701, "rule": "If the cow needs the bald eagle and the cow is cold then the bald eagle is nice."}
{"nr": 8650, "rule": "If something chases the mouse then it visits the cow."}
{"nr": 880, "rule": "If Charlie is young then Charlie is red."}
{"nr": 205, "rule": "If something is big and red then it is quiet."}
{"nr": 11328, "rule": "If someone is white and blue then they are quiet."}
{"nr": 10278, "rule": "If something is smart and furry then it is cold."}
{"nr": 15756, "rule": "If someone eats the tiger and they visit the tiger then they are rough."}
{"nr": 14257, "rule": "If something eats the tiger and the tiger does not like the squirrel then it visits the tiger."}
{"nr": 5989, "rule": "If someone is blue then they eat the mouse."}
{"nr": 4804, "rule": "If someone needs the cat then the cat is red."}
{"nr": 23383, "rule": "If Gary is kind then Gary is cold."}
{"nr": 27448, "rule": "If someone eats the lion then they are young."}
{"nr": 13961, "rule": "If someone is red then they are white."}
{"nr": 7632, "rule": "If Fiona is cold then Fiona is rough."}
{"nr": 3126, "rule": "If something is nice and not kind then it is white."}
{"nr": 13617, "rule": "If something is red and green then it eats the mouse."}
{"nr": 13274, "rule": "If someone visits the tiger and they are round then the tiger is round."}
{"nr": 21084, "rule": "If someone is young then they visit the mouse."}
{"nr": 24214, "rule": "If someone is blue then they like the tiger."}
{"nr": 24384, "rule": "If something likes the dog then it likes the cat."}
{"nr": 15453, "rule": "If Erin is cold then Erin is quiet."}
{"nr": 19933, "rule": "If Dave is young and Dave is furry then Dave is red."}
{"nr": 6203, "rule": "If something visits the bald eagle then it needs the bald eagle."}
{"nr": 15689, "rule": "If someone sees the squirrel then the squirrel eats the dog."}
{"nr": 22737, "rule": "If someone is round then they visit the tiger."}
{"nr": 16428, "rule": "If Harry is kind and Harry is green then Harry is cold."}
{"nr": 8552, "rule": "If the bald eagle needs the lion and the bald eagle is kind then the lion visits the rabbit."}
{"nr": 7550, "rule": "If Anne is furry and Anne is kind then Anne is cold."}
{"nr": 925, "rule": "If Fiona is rough then Fiona is smart."}
{"nr": 10193, "rule": "If something likes the bear and the bear does not chase the rabbit then it visits the bear."}
{"nr": 6082, "rule": "If something is rough then it is smart."}
{"nr": 9567, "rule": "If something is cold and young then it is red."}
{"nr": 23453, "rule": "If someone is nice then they are white."}
{"nr": 7715, "rule": "If the mouse chases the tiger then the tiger is rough."}
{"nr": 16806, "rule": "If the bald eagle does not eat the rabbit and the bald eagle is not round then the rabbit visits the dog."}
{"nr": 1761, "rule": "If the bald eagle eats the cat then the cat visits the lion."}
{"nr": 17209, "rule": "If something is young then it is round."}
{"nr": 11656, "rule": "If someone likes the mouse then the mouse is cold."}
{"nr": 24866, "rule": "If something is rough and it chases the dog then the dog is kind."}
{"nr": 2293, "rule": "If something likes the cat and it is red then it sees the cat."}
{"nr": 2266, "rule": "If the squirrel chases the cow then the squirrel likes the cow."}
{"nr": 951, "rule": "If Dave is rough and Dave is cold then Dave is smart."}
{"nr": 2279, "rule": "If someone is young then they are green."}
{"nr": 5400, "rule": "If something is blue and not big then it is nice."}
{"nr": 20485, "rule": "If someone is kind and smart then they are round."}
{"nr": 17442, "rule": "If someone eats the bald eagle then the bald eagle eats the rabbit."}
{"nr": 5754, "rule": "If someone is blue and green then they are rough."}
{"nr": 25428, "rule": "If something is round then it likes the bear."}
{"nr": 11520, "rule": "If someone is round then they visit the cat."}
{"nr": 21996, "rule": "If something is round then it is rough."}
{"nr": 7017, "rule": "If Fiona is furry and Fiona is round then Fiona is kind."}
{"nr": 9288, "rule": "If the squirrel eats the tiger then the squirrel eats the mouse."}
{"nr": 13752, "rule": "If someone is green then they need the lion."}
{"nr": 19305, "rule": "If someone is red and round then they are kind."}
{"nr": 4732, "rule": "If someone is quiet then they are green."}
{"nr": 24215, "rule": "If the cow is blue then the cow chases the lion."}
{"nr": 12336, "rule": "If something is big and kind then it is young."}
{"nr": 6358, "rule": "If someone is young then they are big."}
{"nr": 19202, "rule": "If someone is young then they are nice."}
{"nr": 4901, "rule": "If someone eats the dog and they are round then they see the squirrel."}
{"nr": 23827, "rule": "If Fiona is nice then Fiona is rough."}
{"nr": 5490, "rule": "If Bob is cold then Bob is smart."}
{"nr": 12897, "rule": "If someone visits the cow then the cow is blue."}
{"nr": 5305, "rule": "If something is quiet then it is kind."}
{"nr": 4977, "rule": "If the mouse sees the rabbit then the rabbit is red."}
{"nr": 23060, "rule": "If someone is blue then they are furry."}
{"nr": 8992, "rule": "If the cat visits the mouse then the mouse is rough."}
{"nr": 9039, "rule": "If Dave is not young then Dave is green."}
{"nr": 11988, "rule": "If the bald eagle is green and the bald eagle is rough then the bald eagle is kind."}
{"nr": 24338, "rule": "If someone is cold then they are young."}
{"nr": 9123, "rule": "If Dave is red then Dave is furry."}
{"nr": 16369, "rule": "If someone is blue then they are green."}
{"nr": 18821, "rule": "If someone likes the dog then they are big."}
{"nr": 7342, "rule": "If Anne is kind and Anne is not nice then Anne is round."}
{"nr": 1843, "rule": "If something eats the cat and it chases the cat then the cat eats the rabbit."}
{"nr": 25466, "rule": "If something is white then it is furry."}
{"nr": 22997, "rule": "If something is white and young then it is kind."}
{"nr": 9387, "rule": "If someone sees the cow then they are big."}
{"nr": 22315, "rule": "If someone is furry then they are young."}
{"nr": 15142, "rule": "If something is blue then it is white."}
{"nr": 10635, "rule": "If something eats the cat and it likes the lion then the lion is young."}
{"nr": 139, "rule": "If Erin is green then Erin is smart."}
{"nr": 638, "rule": "If Gary is not furry then Gary is white."}
{"nr": 4235, "rule": "If something likes the bear and it visits the bear then the bear visits the dog."}
{"nr": 5152, "rule": "If someone chases the lion then the lion chases the rabbit."}
{"nr": 22898, "rule": "If the squirrel is not red then the squirrel visits the cow."}
{"nr": 6848, "rule": "If the mouse is cold then the mouse likes the tiger."}
{"nr": 4287, "rule": "If Anne is nice then Anne is green."}
{"nr": 23831, "rule": "If someone is kind then they like the cat."}
{"nr": 3596, "rule": "If someone is kind and young then they are smart."}
{"nr": 4745, "rule": "If the mouse is green and the mouse is big then the mouse is nice."}
{"nr": 11660, "rule": "If the dog visits the mouse then the mouse is rough."}
{"nr": 10503, "rule": "If someone is kind and not furry then they are nice."}
{"nr": 13524, "rule": "If someone chases the cow then they are rough."}
{"nr": 12052, "rule": "If someone is green then they eat the squirrel."}
{"nr": 21498, "rule": "If someone likes the cat and the cat needs the bear then the bear sees the cat."}
{"nr": 2383, "rule": "If someone sees the lion and they do not eat the lion then they are blue."}
{"nr": 4676, "rule": "If something is young then it is blue."}
{"nr": 7960, "rule": "If Gary is round and Gary is green then Gary is young."}
{"nr": 1844, "rule": "If something needs the bald eagle and it is big then the bald eagle chases the rabbit."}
{"nr": 13265, "rule": "If the rabbit visits the cat then the rabbit is kind."}
{"nr": 16480, "rule": "If someone is cold and they eat the rabbit then they visit the rabbit."}
{"nr": 14291, "rule": "If someone is nice and they do not need the lion then the lion is green."}
{"nr": 19547, "rule": "If someone sees the lion and the lion is nice then they are round."}
{"nr": 5408, "rule": "If Harry is young then Harry is quiet."}
{"nr": 4484, "rule": "If someone is red then they like the tiger."}
{"nr": 2169, "rule": "If someone eats the rabbit then they are cold."}
{"nr": 497, "rule": "If someone is rough then they like the cat."}
{"nr": 6406, "rule": "If the rabbit visits the dog then the rabbit is red."}
{"nr": 7780, "rule": "If something sees the rabbit then it eats the bald eagle."}
{"nr": 15047, "rule": "If the bald eagle is blue and the bear does not chase the bald eagle then the bald eagle chases the bear."}
{"nr": 16350, "rule": "If the mouse does not like the rabbit then the rabbit visits the mouse."}
{"nr": 20149, "rule": "If something likes the squirrel then it is big."}
{"nr": 12263, "rule": "If someone likes the dog then they like the tiger."}
{"nr": 4404, "rule": "If Fiona is big and Fiona is cold then Fiona is kind."}
{"nr": 17090, "rule": "If someone is cold then they are smart."}
{"nr": 8302, "rule": "If someone eats the squirrel and the squirrel likes the rabbit then they are nice."}
{"nr": 5299, "rule": "If someone is green then they eat the dog."}
{"nr": 18420, "rule": "If something is furry and nice then it is cold."}
{"nr": 18396, "rule": "If someone is big then they chase the squirrel."}
{"nr": 12402, "rule": "If someone is white and not furry then they are green."}
{"nr": 17697, "rule": "If someone is red and kind then they are round."}
{"nr": 22194, "rule": "If something visits the mouse and it does not need the mouse then it is blue."}
{"nr": 19342, "rule": "If something is young then it chases the tiger."}
{"nr": 7622, "rule": "If something visits the bear then the bear likes the mouse."}
{"nr": 5268, "rule": "If the lion likes the tiger and the tiger does not like the lion then the lion needs the tiger."}
{"nr": 6139, "rule": "If something is blue and white then it is big."}
{"nr": 2785, "rule": "If something visits the bald eagle then the bald eagle sees the squirrel."}
{"nr": 7297, "rule": "If someone likes the squirrel and the squirrel likes the mouse then the mouse likes the squirrel."}
{"nr": 4849, "rule": "If the mouse is nice and the mouse is cold then the mouse likes the lion."}
{"nr": 19076, "rule": "If something is green and it likes the dog then the dog visits the tiger."}
{"nr": 22392, "rule": "If Dave is rough then Dave is round."}
{"nr": 26483, "rule": "If Harry is red then Harry is white."}
{"nr": 8230, "rule": "If someone is young then they are big."}
{"nr": 17416, "rule": "If something is blue and young then it is nice."}
{"nr": 16402, "rule": "If someone likes the tiger then they visit the lion."}
{"nr": 1369, "rule": "If something is green and white then it is kind."}
{"nr": 6063, "rule": "If someone sees the tiger and they eat the mouse then the mouse sees the tiger."}
{"nr": 22407, "rule": "If someone is cold then they are smart."}
{"nr": 22634, "rule": "If something is kind and not rough then it is nice."}
{"nr": 5264, "rule": "If something likes the lion and the lion chases the tiger then the lion chases the bald eagle."}
{"nr": 18886, "rule": "If someone is kind then they visit the dog."}
{"nr": 20284, "rule": "If someone visits the bald eagle then the bald eagle is blue."}
{"nr": 11923, "rule": "If something is nice and not rough then it is green."}
{"nr": 14356, "rule": "If someone visits the lion and the lion needs the rabbit then they visit the rabbit."}
{"nr": 24421, "rule": "If something likes the bear then it is young."}
{"nr": 26276, "rule": "If something is green and not nice then it is rough."}
{"nr": 10175, "rule": "If something needs the dog and the dog chases the squirrel then it chases the tiger."}
{"nr": 15481, "rule": "If something is round and it eats the rabbit then it likes the rabbit."}
{"nr": 24156, "rule": "If Bob is rough and Bob is blue then Bob is white."}
{"nr": 24333, "rule": "If someone visits the bear then they are kind."}
{"nr": 19889, "rule": "If the mouse is big then the mouse needs the rabbit."}
{"nr": 11317, "rule": "If someone eats the bear then the bear likes the dog."}
{"nr": 22358, "rule": "If something is big and it eats the bear then it chases the dog."}
{"nr": 15812, "rule": "If something sees the cat and it needs the tiger then the cat is round."}
{"nr": 17653, "rule": "If someone needs the tiger and they chase the dog then they chase the tiger."}
{"nr": 6831, "rule": "If the lion needs the tiger and the tiger is round then the lion eats the tiger."}
{"nr": 25962, "rule": "If something sees the bear and it is not rough then the bear sees the cat."}
{"nr": 588, "rule": "If something is blue and it visits the dog then the dog likes the squirrel."}
{"nr": 7186, "rule": "If something needs the lion then it is nice."}
{"nr": 23508, "rule": "If something is green then it is big."}
{"nr": 21738, "rule": "If someone visits the bald eagle then they need the dog."}
{"nr": 22976, "rule": "If someone is kind then they see the bear."}
{"nr": 7568, "rule": "If something likes the bald eagle then it eats the mouse."}
{"nr": 3587, "rule": "If something is cold and it sees the cow then the cow is red."}
{"nr": 22797, "rule": "If someone visits the bald eagle and the bald eagle sees the rabbit then the rabbit is red."}
{"nr": 14647, "rule": "If Charlie is round and Charlie is not green then Charlie is blue."}
{"nr": 10968, "rule": "If the squirrel is big and the squirrel is rough then the squirrel is blue."}
{"nr": 15163, "rule": "If something is nice then it eats the rabbit."}
{"nr": 12699, "rule": "If Anne is cold then Anne is smart."}
{"nr": 2395, "rule": "If something chases the lion then it chases the cat."}
{"nr": 23567, "rule": "If something is round then it chases the lion."}
{"nr": 25572, "rule": "If something likes the cow and it visits the rabbit then the rabbit is round."}
{"nr": 17369, "rule": "If someone is red and not smart then they are round."}
{"nr": 18526, "rule": "If someone is rough and not big then they are nice."}
{"nr": 10665, "rule": "If Anne is nice then Anne is red."}
{"nr": 3767, "rule": "If someone sees the rabbit and they like the mouse then the rabbit visits the mouse."}
{"nr": 21230, "rule": "If Charlie is white and Charlie is rough then Charlie is young."}
{"nr": 20478, "rule": "If someone is cold then they are kind."}
{"nr": 26668, "rule": "If Harry is cold then Harry is young."}
{"nr": 20661, "rule": "If something chases the cat then it chases the mouse."}
{"nr": 23098, "rule": "If Bob is round and Bob is nice then Bob is green."}
{"nr": 20616, "rule": "If someone is green and red then they are blue."}
{"nr": 14444, "rule": "If the bear is red then the bear sees the mouse."}
{"nr": 5545, "rule": "If the tiger needs the lion then the lion needs the bear."}
{"nr": 874, "rule": "If someone is young then they are big."}
{"nr": 4802, "rule": "If someone is red and not green then they are nice."}
{"nr": 18535, "rule": "If something likes the bear and it sees the rabbit then the rabbit sees the lion."}
{"nr": 18928, "rule": "If someone is green then they are white."}
{"nr": 1695, "rule": "If something chases the bear and the bear needs the lion then the bear needs the tiger."}
{"nr": 25923, "rule": "If someone needs the squirrel and they are round then they eat the bear."}
{"nr": 25516, "rule": "If something is round then it is white."}
{"nr": 5, "rule": "If something needs the bear and it does not chase the bear then the bear likes the cat."}
{"nr": 4323, "rule": "If something is red and it likes the bald eagle then the bald eagle is kind."}
{"nr": 13893, "rule": "If Fiona is white and Fiona is young then Fiona is kind."}
{"nr": 23633, "rule": "If the squirrel chases the rabbit then the squirrel is red."}
{"nr": 26142, "rule": "If the bald eagle chases the tiger and the tiger needs the bald eagle then the bald eagle needs the tiger."}
{"nr": 21101, "rule": "If something is green then it chases the cow."}
{"nr": 15597, "rule": "If someone eats the bald eagle then they like the squirrel."}
{"nr": 16654, "rule": "If something is kind then it is rough."}
{"nr": 2568, "rule": "If something needs the dog and it is big then it likes the squirrel."}
{"nr": 10132, "rule": "If someone eats the tiger then the tiger eats the lion."}
{"nr": 20994, "rule": "If someone is quiet and big then they are nice."}
{"nr": 15206, "rule": "If something is rough then it is green."}
{"nr": 26041, "rule": "If Harry is kind then Harry is round."}
{"nr": 21934, "rule": "If someone is red and furry then they are green."}
{"nr": 16647, "rule": "If someone is green then they are kind."}
{"nr": 20886, "rule": "If something sees the bear then it likes the tiger."}
{"nr": 5307, "rule": "If someone is green and they visit the cow then they visit the tiger."}
{"nr": 4583, "rule": "If something is cold then it eats the cow."}
{"nr": 10077, "rule": "If something chases the squirrel then it visits the mouse."}
{"nr": 103, "rule": "If something is cold then it visits the bear."}
{"nr": 15619, "rule": "If someone is smart then they are green."}
{"nr": 16218, "rule": "If someone is furry then they are round."}
{"nr": 13329, "rule": "If someone is smart and big then they are kind."}
{"nr": 25446, "rule": "If something is young then it is white."}
{"nr": 24286, "rule": "If Charlie is quiet then Charlie is blue."}
{"nr": 17148, "rule": "If someone is red then they see the mouse."}
{"nr": 4978, "rule": "If the tiger likes the mouse and the tiger likes the rabbit then the rabbit likes the bald eagle."}
{"nr": 2166, "rule": "If someone eats the dog and the dog needs the rabbit then the dog is cold."}
{"nr": 7509, "rule": "If someone sees the bald eagle then the bald eagle is young."}
{"nr": 22825, "rule": "If someone is blue and furry then they are white."}
{"nr": 6498, "rule": "If someone is rough then they like the mouse."}
{"nr": 18804, "rule": "If someone chases the cow then the cow is young."}
{"nr": 5004, "rule": "If something sees the tiger and the tiger is not nice then it visits the bear."}
{"nr": 11583, "rule": "If someone is nice and not round then they are cold."}
{"nr": 8869, "rule": "If something is kind then it sees the rabbit."}
{"nr": 8519, "rule": "If something likes the rabbit then it is big."}
{"nr": 9782, "rule": "If Anne is kind then Anne is red."}
{"nr": 21129, "rule": "If the rabbit needs the cow and the rabbit chases the cow then the cow needs the squirrel."}
{"nr": 5033, "rule": "If someone is young and not cold then they are rough."}
{"nr": 19012, "rule": "If something chases the mouse then the mouse chases the cow."}
{"nr": 2199, "rule": "If Fiona is rough and Fiona is kind then Fiona is white."}
{"nr": 27455, "rule": "If someone is green then they are big."}
{"nr": 5733, "rule": "If someone is big and they see the cat then they like the cat."}
{"nr": 20792, "rule": "If something chases the bear then it chases the cat."}
{"nr": 21149, "rule": "If someone is kind then they are rough."}
{"nr": 23429, "rule": "If something is blue and it needs the cow then it eats the cow."}
{"nr": 6244, "rule": "If something eats the cat and the cat chases the bear then the cat needs the dog."}
{"nr": 23121, "rule": "If something is young then it is kind."}
{"nr": 220, "rule": "If something sees the mouse then the mouse sees the lion."}
{"nr": 24658, "rule": "If the mouse is big then the mouse chases the bald eagle."}
{"nr": 2292, "rule": "If something needs the squirrel then it is rough."}
{"nr": 25717, "rule": "If something is nice and blue then it is round."}
{"nr": 19888, "rule": "If the rabbit does not need the dog then the dog sees the tiger."}
{"nr": 27253, "rule": "If someone visits the dog then the dog sees the rabbit."}
{"nr": 8063, "rule": "If something is red and not blue then it visits the squirrel."}
{"nr": 26923, "rule": "If something is red and rough then it is quiet."}
{"nr": 7909, "rule": "If something sees the lion and the lion is round then it sees the cat."}
{"nr": 5962, "rule": "If someone visits the squirrel then they like the bear."}
{"nr": 4844, "rule": "If someone is green then they are nice."}
{"nr": 17765, "rule": "If someone is nice then they are big."}
{"nr": 14702, "rule": "If someone is round then they eat the cat."}
{"nr": 23426, "rule": "If the dog likes the bear then the dog is blue."}
{"nr": 17646, "rule": "If someone is kind and not red then they are green."}
{"nr": 19196, "rule": "If the tiger is green and the tiger is not big then the tiger likes the cat."}
{"nr": 12485, "rule": "If something is furry then it is smart."}
{"nr": 18273, "rule": "If Erin is rough then Erin is round."}
{"nr": 15693, "rule": "If someone eats the dog then they need the dog."}
{"nr": 13437, "rule": "If something eats the bald eagle then the bald eagle chases the cow."}
{"nr": 20910, "rule": "If something needs the bald eagle and it eats the bald eagle then it needs the cow."}
{"nr": 6181, "rule": "If the squirrel needs the bald eagle and the bald eagle is green then the bald eagle is kind."}
{"nr": 6395, "rule": "If someone is blue and they need the rabbit then the rabbit likes the bald eagle."}
{"nr": 18945, "rule": "If something is red then it is green."}
{"nr": 23850, "rule": "If someone likes the cow and they are not nice then they are green."}
{"nr": 13643, "rule": "If something likes the bear and it chases the tiger then it chases the bear."}
{"nr": 25450, "rule": "If someone sees the bald eagle then the bald eagle needs the bear."}
{"nr": 14346, "rule": "If something is rough and it likes the dog then the dog needs the tiger."}
{"nr": 25730, "rule": "If something eats the bald eagle then it eats the dog."}
{"nr": 9880, "rule": "If someone is green then they are round."}
{"nr": 9095, "rule": "If something needs the bald eagle and it is young then it is green."}
{"nr": 9495, "rule": "If someone eats the cow then they like the bear."}
{"nr": 15794, "rule": "If something is smart then it is white."}
{"nr": 6147, "rule": "If the mouse does not eat the lion then the lion visits the mouse."}
{"nr": 8087, "rule": "If someone is round then they visit the bald eagle."}
{"nr": 25208, "rule": "If something sees the bald eagle and the bald eagle likes the rabbit then the rabbit likes the dog."}
{"nr": 14719, "rule": "If someone visits the dog and they eat the lion then the dog sees the tiger."}
{"nr": 5376, "rule": "If the rabbit visits the squirrel then the rabbit likes the bear."}
{"nr": 16087, "rule": "If Harry is green then Harry is furry."}
{"nr": 26140, "rule": "If Harry is young then Harry is green."}
{"nr": 22298, "rule": "If someone chases the bear then they see the squirrel."}
{"nr": 27122, "rule": "If something sees the dog then it sees the rabbit."}
{"nr": 26558, "rule": "If something sees the squirrel then it eats the tiger."}
{"nr": 19149, "rule": "If something needs the tiger and the tiger is big then the tiger needs the cow."}
{"nr": 24820, "rule": "If something is big then it is round."}
{"nr": 13053, "rule": "If Fiona is quiet then Fiona is smart."}
{"nr": 19368, "rule": "If the bald eagle eats the cow and the cow visits the bald eagle then the cow is nice."}
{"nr": 639, "rule": "If something is young then it is kind."}
{"nr": 24315, "rule": "If someone is green then they chase the bald eagle."}
